const GP_EN = [
  'A 安徽',
  'B 北京',
  'C 重庆',
  'F 福建',
  'G 广西',
  'G 贵州',
  'G 广东',
  'G 甘肃',
  'H 海南',
  'H 湖北',
  'H 黑龙江',
  'H 河南',
  'H 河北',
  'H 湖南',
  'J 江苏',
  'J 吉林',
  'J 江西',
  'L 辽宁',
  'N 内蒙古',
  'N 宁夏',
  'Q 青海',
  'S 四川',
  'S 陕西',
  'S 上海',
  'S 山东',
  'S 山西',
  'T 天津',
  'X 西藏',
  'X 新疆',
  'Y 云南',
  'Z 浙江']
const GC1 = []
GC1['A 安徽'] = ['合肥', '阜阳', '芜湖', '蚌埠', '淮南', '马鞍山', '淮北', '铜陵',
  '安庆', '黄山', '滁州', '宿州', '六安', '亳州', '池州', '宣城']
GC1['B 北京'] = ['北京']
GC1['C 重庆'] = ['重庆']
GC1['F 福建'] = ['福州', '厦门', '三明', '莆田', '泉州', '漳州', '南平', '龙岩', '宁德']
GC1['G 广西'] = ['南宁', '百色', '柳州', '桂林', '梧州', '北海', '防城港',
  '钦州', '贵港', '玉林', '贺州', '河池', '来宾', '崇左']
GC1['G 贵州'] = ['贵阳', '六盘水', '遵义', '安顺', '铜仁', '毕节',
  '黔东南苗族侗族自治州', '黔西南布依族苗族自治州', '黔南布依族苗族自治州']
GC1['G 广东'] = ['广州', '深圳', '珠海', '汕头', '韶关', '河源', '梅州',
  '惠州', '汕尾', '东莞', '中山', '江门', '佛山', '阳江',
  '云浮', '湛江', '茂名', '肇庆', '清远', '潮州', '揭阳']
GC1['G 甘肃'] = ['兰州', '金昌', '白银', '天水', '嘉峪关', '武威', '张掖',
  '平凉', '酒泉', '庆阳', '定西', '陇南', '甘南藏族自治州', '临夏回族自治州']
GC1['H 海南'] = ['海口', '三亚', '五指山', '琼海', '儋州', '文昌', '万宁', '东方', '澄迈县',
  '定安县', '屯昌县', '临高县', '白沙黎族自治县', '昌江黎族自治县', '乐东黎族自治县', '陵水黎族自治县',
  '琼中黎族苗族自治县', '保亭黎族苗族自治县', '南沙群岛', '西沙群岛', '中沙群岛的岛礁及其海域']
GC1['H 湖北'] = ['武汉', '黄石', '襄阳', '十堰', '荆州', '宜昌', '荆门',
  '鄂州', '孝感', '黄冈', '咸宁', '随州', '仙桃', '天门', '潜江', '神农架林区', '恩施土家族苗族自治州']
GC1['H 黑龙江'] = ['哈尔滨', '齐齐哈尔', '鹤岗', '双鸭山', '鸡西', '大庆',
  '伊春', '牡丹江', '佳木斯', '七台河', '黑河', '绥化', '大兴安岭']
GC1['H 河南'] = ['郑州', '鹤壁', '开封', '洛阳', '平顶山', '焦作', '新乡',
  '安阳', '濮阳', '许昌', '漯河', '三门峡', '南阳', '商丘', '信阳', '周口', '驻马店']
GC1['H 河北'] = ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台',
  '保定', '张家口', '承德', '沧州', '廊坊', '衡水']
GC1['H 湖南'] = ['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德',
  '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '湘西土家族苗族自治州']
GC1['J 江苏'] = ['南京', '徐州', '连云港', '淮安', '宿迁', '太仓', '盐城',
  '扬州', '泰州', '南通', '镇江', '常州', '无锡', '苏州', '昆山', '江阴', '张家港', '常熟']
GC1['J 吉林'] = ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '延边朝鲜族自治州']
GC1['J 江西'] = ['南昌', '景德镇', '萍乡', '新余', '九江', '鹰潭', '赣州', '吉安', '宜春', '抚州', '上饶']
GC1['L 辽宁'] = ['沈阳', '大连', '本溪', '鞍山', '抚顺', '丹东',
  '锦州', '葫芦岛', '营口', '盘锦', '阜新', '辽阳', '铁岭', '朝阳']
GC1['N 内蒙古'] = ['呼和浩特', '乌兰察布', '锡林郭勒盟', '巴彦淖尔',
  '阿拉善盟', '兴安盟', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔']
GC1['N 宁夏'] = ['银川', '石嘴山', '吴忠', '中卫', '固原']
GC1['Q 青海'] = ['西宁', '海东', '海北藏族自治州', '黄南藏族自治州', '海南藏族自治州',
  '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州']
GC1['S 四川'] = ['成都', '自贡', '攀枝花', '泸州', '德阳', '绵阳', '广元', '遂宁', '内江',
  '乐山', '南充', '宜宾', '广安', '达州', '巴中', '眉山',
  '资阳', '雅安', '阿坝藏族羌族自治州', '甘孜藏族自治州', '凉山彝族自治州']
GC1['S 陕西'] = ['西安', '铜川', '宝鸡', '咸阳', '渭南', '延安', '汉中', '榆林', '安康', '商洛']
GC1['S 上海'] = ['上海']
GC1['S 山东'] = ['济南', '青岛', '聊城', '滨州', '菏泽', '潍坊', '日照', '淄博',
  '枣庄', '东营', '烟台', '威海', '济宁', '泰安', '莱芜', '德州', '临沂']
GC1['S 山西'] = ['太原', '大同', '阳泉', '长治', '晋城', '朔州', '晋中', '忻州', '临汾', '运城', '吕梁']
GC1['T 天津'] = ['天津']
GC1['X 西藏'] = ['拉萨', '那曲', '昌都', '山南', '日喀则', '阿里', '林芝']
GC1['X 新疆'] = ['乌鲁木齐', '克拉玛依', '石河子', '阿拉尔', '图木舒克', '五家渠',
  '吐鲁番', '哈密', '和田', '喀什', '阿克苏', '克孜勒苏柯尔克孜自治州', '巴音郭楞蒙古自治州',
  '昌吉回族自治州', '博尔塔拉蒙古自治州', '伊犁哈萨克自治州', '阿勒泰地区', '塔城地区']
GC1['Y 云南'] = ['昆明', '曲靖', '玉溪', '保山', '昭通', '普洱', '临沧', '丽江',
  '文山壮族苗族自治州', '红河哈尼族彝族自治州', '西双版纳傣族自治州', '楚雄彝族自治州',
  '大理白族自治州', '德宏傣族景颇族自治州', '怒江傈傈族自治州', '迪庆藏族自治州']
GC1['Z 浙江'] = ['杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴',
  '金华', '舟山', '台州', '丽水', '衢州', '义乌']

export {
  GP_EN,
  GC1
}
