<template>
  <div class="wrapper">
    <div><img :src="img1" /></div>

    <div class="ipt_clear" style="margin-top:60px;">
        <input
          v-model="mobile"
          id="mobile"
          type="number"
          name="mobile"
          class="ipt no_radius"
          placeholder="电话">
    </div>
    <div class="ipt_clear">
        <input
          v-model="surName"
          id="surName"
          type="text"
          name="surName"
          class="ipt ipt1 no_radius"
          placeholder="姓">
        <input
          v-model="givenName"
          id="givenName"
          type="text"
          name="givenName"
          class="ipt ipt2 no_radius"
          placeholder="名">
    </div>
    <div class="ipt_clear">
        <select
          id="title"
          name="title"
          class="ipt select">
            <option value="">称谓</option>
            <option value="先生">先生</option>
            <option value="女士">女士</option>
        </select>
    </div>
    <div class="ipt_clear">
        <select
          id="myCarType"
          v-model="myCarType"
          name="myCarType"
          class="ipt select"
          @change="carChange">
            <option
              v-for="item in carType"
              :key="item">{{ item.type }}</option>
        </select>
    </div>
    <div class="ipt_clear">
        <select
          id="myCarModel"
          v-model="myCarModel"
          name="myCarModel"
          class="ipt select">
            <option
              v-for="item in carModel"
              :key="item">{{ item.model }}</option>
        </select>
    </div>

    <div class="ipt_clear">
        <select
          id="province"
          v-model="myProvince"
          name="province"
          class="ipt select"
          @change="schange">
            <option
              v-for="item in province"
              :key="item">{{ item }}</option>
        </select>
    </div>

    <div class="ipt_clear">
        <select
          id="city"
          v-model="myCity"
          name="city"
          class="ipt select"
          @change="cchange">
            <option
              v-for="item in city"
              :key="item">{{ item }}</option>
        </select>
    </div>

    <div class="ipt_clear">
        <select
          id="store"
          v-model="myStore"
          name="store"
          class="ipt select"
          @change="showPoint">
            <option
              v-for="item in store"
              :key="item">{{ item }}</option>
        </select>
    </div>

    <div class="ipt_clear">
      <div class="ipt_labelx">
        已为您推荐最近4s店
      </div>
    </div>


    <div class="fdbtn">
      <div class="tj">
        <button
          type="button"
          name="submit"
          @click="submitForm"
          class="btn">提交测试</button>
      </div>

      <div class="ipt_label">
        <div style="line-height:150%; font-size:26px;">我已阅读并接受个人信息保护</div>
        <div style="line-height:150%; font-size:30px;"><a href="#" @click="showPop" style="color:blue; text-decoration:underline; ">法律声明</a></div>
      </div>

      <div id="fl" class="flsm" :style="{'display':isPop?'block':'none'}">
        <div class="flbg"></div>
        <div class="flbody">
          <div class="flclose" @click="closePop">X</div>
          <div class="fl_title">法律声明</div>
          <div class="fl_memo">
            <p>文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字</p>
            <p>文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文</p>
            <p>文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文</p>
            <p>文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文</p>
            <p>文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文ssdfsf</p>
            <p>文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文字文</p>
          </div>
          <div class="fl_close" @click="closePop">关闭</div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  import img1 from '@/static/img/top.jpg';
  export default {
    data () {
      return {
        img1,
        isPop: false,
        isshow: true,
        isPosition: false,
        name: '',
        mobile: '',
        carType: [
          { 'type': '车系', subs: [ { 'model': '车型'} ]},
          { 'type': 'BMW 1系', subs: [ { 'model': '车型'}, { 'model': 'BMW 1系两厢运动轿车'}, { 'model': 'BMW 1系三厢运动轿车'} ]},
          { 'type': 'BMW 2系', subs: [ { 'model': '车型'}, { 'model': 'BMW 2系双门轿跑车'}, { 'model': 'BMW 2系敞篷轿跑车'}, { 'model': '新BMW 2系旅行车'}, { 'model': '新BMW 2系多功能旅行车'} ] },
          { 'type': 'BMW 3系', subs: [ { 'model': '车型'}, { 'model': 'BMW 3系四门轿车长轴距版'}, { 'model': 'BMW 3系四门轿车标准轴距版'}, { 'model': 'BMW 3系GT'} ] },
          { 'type': 'BMW 4系', subs: [ { 'model': '车型'}, { 'model': 'BMW 4系双门轿跑车'}, { 'model': 'BMW 4系敞篷轿跑车'}, { 'model': 'BMW 4系四门轿跑车'}, { 'model': ''} ] },
          { 'type': 'BMW 5系', subs: [ { 'model': '车型'}, { 'model': 'BMW 5系长轴距版'}, { 'model': 'BMW 5系标准轴距版'}, { 'model': '2019款新BMW 5系插电式混合动力'}, { 'model': ''} ] },
          { 'type': 'BMW 6系', subs: [ { 'model': '车型'}, { 'model': 'BMW 6系四门轿跑车'}, { 'model': 'BMW 6系双门轿跑车'}, { 'model': 'BMW 6系敞篷轿跑车'}, { 'model': '新BMW 6系GT 2019款'} ] },
          { 'type': 'BMW 7系', subs: [ { 'model': '车型'}, { 'model': 'BMW 7系'} ] },
          { 'type': 'BMW X', subs: [ { 'model': '车型'}, { 'model': 'BMW X1'}, { 'model': '创新BMW X2'}, { 'model': '全新BMW X3'}, { 'model': '全新BMW X4'}, { 'model': '全新BMW X5'}, { 'model': '2019款BMW X6'}, { 'model': '创新BMW X7'} , { 'model': 'BMW X1插电式混合动力里程升级版'}] },
          { 'type': 'BMW i', subs: [ { 'model': '车型'}, { 'model': '新纯电动BMW i3快充款'}, { 'model': '创新BMW i8敞篷跑车'} ] },
          { 'type': 'BMW M', subs: [ { 'model': '车型'}, { 'model': '全新BMW M2雷霆版'}, { 'model': 'BMW M3'}, { 'model': 'BMW M4双门轿跑车'}, { 'model': 'BMW M4敞篷轿跑车'}, { 'model': '新BMW M5'}, { 'model': 'BMW M5 Sedan'}, { 'model': 'BMW M6四门轿跑车'}, { 'model': 'BMW M6双门轿跑车'}, { 'model': 'BMW X5 M'}, { 'model': 'BMW X6 M'} ] },
          { 'type': '电动性能', subs: [ { 'model': '车型'}, { 'model': 'BMW X1插电式混合动力里程升级版'}, { 'model': '2019款新BMW 5系插电式混合动力'} ] },
          { 'type': 'BMW 8系', subs: [ { 'model': '车型'}, { 'model': '全新BMW 8系敞篷轿跑车'}, { 'model': '全新BMW 8系双门轿跑车'} ] }
        ],
        myCarType: '车系',
        carModel: [ { 'model': '车型'} ],
        myCarModel: '车型',
        myProvince: '',
        myCity: '',
        myStore: '',
        province: [],
        myLocal: null,
        city: [],
        resPoints: [],
        allStore: [
          { 'lng': 106.62030400, 'lat': 26.65053400, 'metadata': { 'name': '贵阳宝源汽车销售服务有限公司', 'address': '贵州省贵阳市金阳新区迎宾西路1号(市政府直行800米)邮编550081', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 113.08533414, 'lat': 36.17733835, 'metadata': { 'name': '长治宝诚潞府汽车销售服务有限公司', 'address': '山西省长治市西一环路针漳村101号（近五针街）邮编：046000', 'province': '山西省', 'city': '长治市' } },
          { 'lng': 120.57148500, 'lat': 27.69333100, 'metadata': { 'name': '平阳力宝行汽车销售服务有限公司', 'address': '浙江省温州市平阳县昆阳镇建丰村路口104国道边', 'province': '浙江省', 'city': '平阳市' } },
          { 'lng': 113.60421600, 'lat': 28.16185700, 'metadata': { 'name': '浏阳美宝行汽车销售服务有限公司', 'address': '湖南省浏阳市汽车西站往太平桥方向800米,410300', 'province': '湖南省', 'city': '浏阳市' } },
          { 'lng': 113.10787800, 'lat': 23.01221200, 'metadata': { 'name': '佛山通宝汽车销售服务有限公司-禅城分公司', 'address': '广东省佛山市佛山大道,528000', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 121.50572600, 'lat': 38.97734300, 'metadata': { 'name': '大连中升汇宝汽车销售服务有限公司', 'address': '辽宁省大连市甘井子区虹城路550号，116000', 'province': '辽宁省', 'city': '大连市' } },
          { 'lng': 117.26642443, 'lat': 31.94705471, 'metadata': { 'name': '合肥宝利丰汽车销售服务有限公司', 'address': '安徽省合肥市庐阳区蒙城北路2100号邮编:230041', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 100.40767800, 'lat': 38.94294300, 'metadata': { 'name': '张掖金裕宝汽车销售服务有限公司', 'address': '甘肃省张掖市滨河新区西三环创业大道金岛汽车城,734000', 'province': '甘肃省', 'city': '张掖市' } },
          { 'lng': 116.42289000, 'lat': 39.99669100, 'metadata': { 'name': '北京盈之宝北苑路汽车维修服务有限公司', 'address': '北京朝阳区北苑路安惠里5区10号邮编100101', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 123.20432600, 'lat': 41.72149400, 'metadata': { 'name': '沈阳中顺盛宝汽车销售服务有限公司', 'address': '沈阳经济技术开发区沈辽西路191号邮政编码：110024', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 120.31938917, 'lat': 31.67600874, 'metadata': { 'name': '无锡宝诚高惠汽车销售有限公司', 'address': '江苏省无锡市惠山大道1555号高力汽车城，214174', 'province': '江苏省', 'city': '无锡市' } },
          { 'lng': 111.05558800, 'lat': 35.09585500, 'metadata': { 'name': '运城市宝诚汽车销售服务有限公司', 'address': '山西省运城市空港新区康杰北路34号邮编：044000', 'province': '山西省', 'city': '运城市' } },
          { 'lng': 129.68036400, 'lat': 44.62835900, 'metadata': { 'name': '牡丹江龙宝汽车销售服务有限公司', 'address': '牡丹江市阳明区矿山东路和裕民路交叉口', 'province': '黑龙江省', 'city': '牡丹江市' } },
          { 'lng': 117.32299886, 'lat': 32.87367648, 'metadata': { 'name': '蚌埠宝利丰汽车销售服务有限公司', 'address': '安徽省蚌埠市迎宾大道西、中环线南21号邮编：230031', 'province': '安徽省', 'city': '蚌埠市' } },
          { 'lng': 119.91204113, 'lat': 32.42606119, 'metadata': { 'name': '泰州信宝行汽车销售服务有限公司', 'address': '泰州市经济开发区国际汽车城纬八路99号', 'province': '江苏省', 'city': '泰州市' } },
          { 'lng': 120.81710485, 'lat': 30.73462511, 'metadata': { 'name': '嘉兴骏宝行汽车销售服务有限公司', 'address': '浙江省嘉兴市南湖区由拳路3910号邮编314051', 'province': '浙江省', 'city': '嘉兴市' } },
          { 'lng': 116.59116090, 'lat': 23.64114137, 'metadata': { 'name': '潮州市合宝汽车销售服务有限公司', 'address': '广东省潮州市枫溪区新风路火车站斜对面邮编521031', 'province': '广东省', 'city': '潮州市' } },
          { 'lng': 120.17047595, 'lat': 30.30831228, 'metadata': { 'name': '杭州和诚之宝汽车销售服务有限公司', 'address': '浙江省杭州市下城区绍兴路381号邮编：310004', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 118.51059373, 'lat': 31.64639276, 'metadata': { 'name': '马鞍山市宝景汽车销售服务有限公司', 'address': '马鞍山经济技术开发区太白大道9号邮编：243000', 'province': '安徽省', 'city': '马鞍山市' } },
          { 'lng': 101.86821913, 'lat': 36.57221737, 'metadata': { 'name': '青海金裕宝汽车销售有限公司', 'address': '青海省西宁市西宁经济技术开发区昆仑东路6号邮编：810007', 'province': '青海省', 'city': '西宁市' } },
          { 'lng': 112.50470500, 'lat': 34.63047700, 'metadata': { 'name': '洛阳豫德宝汽车销售服务有限公司', 'address': '河南省洛阳市龙门大道300号邮编：471000', 'province': '河南省', 'city': '洛阳市' } },
          { 'lng': 124.38361700, 'lat': 40.11919200, 'metadata': { 'name': '丹东信宝行汽车销售服务有限公司', 'address': '辽宁省丹东市振兴区花园路198号', 'province': '辽宁省', 'city': '丹东市' } },
          { 'lng': 107.52298300, 'lat': 26.31045300, 'metadata': { 'name': '都匀宝源汽车销售服务有限公司', 'address': '都匀市毛尖大道茂盛汽车城羊场坝仓库11号，558000', 'province': '贵州省', 'city': '都匀市' } },
          { 'lng': 121.19743537, 'lat': 30.02274321, 'metadata': { 'name': '余姚宝恒汽车销售服务有限公司', 'address': '浙江省余姚市梨洲街道华昌路3号', 'province': '浙江省', 'city': '余姚市' } },
          { 'lng': 121.43363857, 'lat': 31.07920821, 'metadata': { 'name': '上海宝景汽车销售服务有限公司', 'address': '上海市闵行区莲花南路2268号邮编：201108', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 117.21447749, 'lat': 36.21292766, 'metadata': { 'name': '泰安广宝汽车销售服务有限公司', 'address': '山东省泰安市东部开发区博阳路中段，271000', 'province': '山东省', 'city': '泰安市' } },
          { 'lng': 118.09249598, 'lat': 24.48431830, 'metadata': { 'name': '厦门中宝汽车有限公司滨北分公司', 'address': '福建省厦门市思明区湖滨东路309号', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 120.40497865, 'lat': 27.51765424, 'metadata': { 'name': '苍南宝隆汽车销售服务有限公司', 'address': '浙江省温州市苍南县灵溪镇（苍南高速出口100米处）邮编：325800', 'province': '浙江省', 'city': '苍南市' } },
          { 'lng': 120.42900700, 'lat': 41.60926200, 'metadata': { 'name': '朝阳汇华宝汽车销售服务有限公司', 'address': '辽宁省朝阳市龙城区龙泉大街二段创世纪财富中心C座101号.122000', 'province': '辽宁省', 'city': '朝阳市' } },
          { 'lng': 116.56997608, 'lat': 40.02359601, 'metadata': { 'name': '北京晨德宝汽车销售服务有限公司', 'address': '北京市朝阳区金乡东苇路北京金港展览展示有限公司C区10号1001邮编100018', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 120.66248000, 'lat': 27.99157900, 'metadata': { 'name': '温州市好达机电有限公司鹿城分公司', 'address': '浙江省温州市鹿城区过境公路南端1号，325011', 'province': '浙江省', 'city': '温州市' } },
          { 'lng': 102.20904100, 'lat': 27.94929100, 'metadata': { 'name': '西昌瑞孚宝汽车销售服务有限公司', 'address': '四川省西昌市安宁镇西昌学院北校区往西宁方向前行1公里右侧,615013', 'province': '四川省', 'city': '西昌市' } },
          { 'lng': 113.38114427, 'lat': 23.14582839, 'metadata': { 'name': '广州市昌宝汽车销售服务有限公司', 'address': '广州市天河区广园快速路博汇街1号邮政编码：510000', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 120.68709368, 'lat': 30.55071821, 'metadata': { 'name': '嘉兴宝华汽车销售服务有限公司', 'address': '浙江省嘉兴海宁经济开发区文苑路489号邮政编码：311406', 'province': '浙江省', 'city': '嘉兴市' } },
          { 'lng': 98.42554400, 'lat': 39.77123200, 'metadata': { 'name': '酒泉金驰宝汽车销售服务有限公司', 'address': '甘肃省酒泉市西郊工业园区，735000', 'province': '甘肃省', 'city': '酒泉市' } },
          { 'lng': 120.55713815, 'lat': 31.33187676, 'metadata': { 'name': '苏州宝华汽车销售服务有限公司', 'address': '苏州新区塔园路399号邮编：2150129', 'province': '江苏省', 'city': '苏州市' } },
          { 'lng': 125.16355789, 'lat': 46.56838983, 'metadata': { 'name': '大庆市中顺宝汽车销售服务有限公司', 'address': '黑龙江省大庆市高新区新兴东街8号，163316', 'province': '黑龙江省', 'city': '大庆市' } },
          { 'lng': 121.37307500, 'lat': 31.17648800, 'metadata': { 'name': '上海宝信汽车销售服务有限公司', 'address': '上海市闵行区吴中路1786号邮编201103', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 87.49069700, 'lat': 43.85925700, 'metadata': { 'name': '乌鲁木齐燕宝汽车销售服务有限公司', 'address': '新疆维吾尔自治区乌鲁木齐市经济技术开发区喀纳斯湖北路621号，830026', 'province': '新疆维吾尔自治区', 'city': '乌鲁木齐市' } },
          { 'lng': 119.51038301, 'lat': 32.18498145, 'metadata': { 'name': '镇江宝德汽车服务有限公司', 'address': '江苏省镇江丁卯开发区丁卯桥路296号邮编212009', 'province': '江苏省', 'city': '镇江市' } },
          { 'lng': 118.81092042, 'lat': 31.99851246, 'metadata': { 'name': '南京宁宝汽车服务有限公司', 'address': '江苏省南京市秦淮区大明路278号邮编210012', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 116.51774000, 'lat': 40.22030600, 'metadata': { 'name': '北京运通嘉宝汽车销售服务有限公司', 'address': '北京市顺义区赵全营镇昌金路赵全营段231号6号楼101101322', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 120.09463106, 'lat': 30.26297815, 'metadata': { 'name': '杭州金昌杭德汽车服务有限公司', 'address': '杭州市西湖区西溪路722号', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 114.37572200, 'lat': 30.60110700, 'metadata': { 'name': '武汉宝泽行汽车维修服务有限公司', 'address': '湖北省武汉市洪山区和平乡铁机村2号', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 104.65150866, 'lat': 28.75147140, 'metadata': { 'name': '宜宾宝远汽车销售服务有限公司', 'address': '宜宾市翠屏区南岸东区七星路与宜珙路铁路之间1幢', 'province': '四川省', 'city': '宜宾市' } },
          { 'lng': 118.34293307, 'lat': 35.04416230, 'metadata': { 'name': '临沂宝景汽车销售服务有限公司', 'address': '山东省临沂市兰山区海关路16号', 'province': '山东省', 'city': '临沂市' } },
          { 'lng': 121.46015700, 'lat': 29.88054400, 'metadata': { 'name': '宁波宝诚汽车销售服务有限公司', 'address': '浙江省宁波市鄞州区集士港镇秋实北路88号', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 120.19639000, 'lat': 30.27954500, 'metadata': { 'name': '南京宝景汽车销售服务有限公司', 'address': '江苏省南京市浦口区浦珠南路8号邮政编码：211899', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 120.72969201, 'lat': 27.97453436, 'metadata': { 'name': '温州力宝行汽车销售服务有限公司', 'address': '温州经济技术开发区高新园区高一路178号邮编325000', 'province': '浙江省', 'city': '温州市' } },
          { 'lng': 117.49727700, 'lat': 38.98538500, 'metadata': { 'name': '天津运通宝翔汽车销售服务有限公司', 'address': '天津市津南区葛沽镇滨海盛世汽车园盛裕园4号,300457', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 120.21819800, 'lat': 30.36271800, 'metadata': { 'name': '杭州运通祥宝汽车销售服务有限公司', 'address': '浙江省杭州市江干区临丁路639号，310021', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 104.00159358, 'lat': 30.71922689, 'metadata': { 'name': '成都宝悦二手车中心有限公司', 'address': '成都市金牛区金科南路3号', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 123.85443500, 'lat': 41.33697700, 'metadata': { 'name': '本溪汇盛宝汽车销售服务有限公司', 'address': '本溪市明山区卧龙镇青沙岭汽车工业园A区1号', 'province': '辽宁省', 'city': '本溪市' } },
          { 'lng': 113.23050200, 'lat': 22.65078200, 'metadata': { 'name': '中山市宝宁汽车销售服务有限公司', 'address': '广东省中山市小榄镇永宁菊城大道西176号528415', 'province': '广东省', 'city': '中山市' } },
          { 'lng': 120.33162400, 'lat': 30.44171500, 'metadata': { 'name': '杭州宝驿汽车销售服务有限公司', 'address': '杭州市余杭区东湖街道星光街以南', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 120.92281000, 'lat': 30.06570000, 'metadata': { 'name': '上虞金昌宝顺汽车销售服务有限公司', 'address': '上虞市小越镇新宅村邮编：312367', 'province': '浙江省', 'city': '上虞市' } },
          { 'lng': 115.76624600, 'lat': 33.83652500, 'metadata': { 'name': '亳州众国宝祥汽车销售服务有限公司', 'address': '安徽省亳州市工业园区杜仲路812号，236800', 'province': '安徽省', 'city': '亳州市' } },
          { 'lng': 106.99004100, 'lat': 33.13517700, 'metadata': { 'name': '汉中恒信宝汽车销售服务有限公司', 'address': '陕西省汉中市经济开发区北区108国道北侧，723000', 'province': '陕西省', 'city': '汉中市' } },
          { 'lng': 118.48958800, 'lat': 36.74950600, 'metadata': { 'name': '潍坊乾宝行汽车销售服务有限公司', 'address': '山东省潍坊市青州市玲珑山北路3777号，262500', 'province': '山东省', 'city': '潍坊市' } },
          { 'lng': 123.36754100, 'lat': 41.81942200, 'metadata': { 'name': '沈阳汇中宝汽车销售服务有限公司', 'address': '辽宁省沈阳市铁西区北二中路18甲1-1号，110025', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 109.00290600, 'lat': 34.34553600, 'metadata': { 'name': '西安中升汇宝汽车销售服务有限公司', 'address': '陕西省西安市浐灞生态区北辰大道与欧亚三路东南角，710024', 'province': '陕西省', 'city': '西安市' } },
          { 'lng': 106.75220000, 'lat': 26.62709700, 'metadata': { 'name': '贵阳通源宝源汽车售后服务有限公司', 'address': '贵州省贵阳市乌当区新添大道北段2号，550018', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 112.25490600, 'lat': 31.05076800, 'metadata': { 'name': '荆门宝泽汽车销售服务有限公司', 'address': '湖北省荆门市月亮湖路48号448000', 'province': '湖北省', 'city': '荆门市' } },
          { 'lng': 119.81511800, 'lat': 31.41600900, 'metadata': { 'name': '宜兴宝利丰汽车服务有限公司', 'address': '江苏省宜兴市屺亭街道赛特大道130-6号', 'province': '江苏省', 'city': '宜兴市' } },
          { 'lng': 121.63123400, 'lat': 31.30431900, 'metadata': { 'name': '上海宝诚申江汽车销售服务有限公司', 'address': '上海市浦东新区申江路296号，201208', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 121.40484900, 'lat': 31.28366000, 'metadata': { 'name': '上海宝信行汽车销售服务有限公司', 'address': '上海市普陀区真北路3489号', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 115.01557300, 'lat': 30.14279900, 'metadata': { 'name': '黄石宝汇汽车销售服务有限公司', 'address': '湖北省黄石市经济技术开发区大棋大道298号，435000', 'province': '湖北省', 'city': '黄石市' } },
          { 'lng': 120.80220400, 'lat': 31.64034400, 'metadata': { 'name': '常熟龙之宝汽车销售服务有限公司', 'address': '江苏省常熟市虞山镇长安路9号,215500', 'province': '江苏省', 'city': '常熟市' } },
          { 'lng': 103.67584800, 'lat': 31.03204400, 'metadata': { 'name': '都江堰盛孚宝汽车销售服务有限公司', 'address': '四川省都江堰市蒲阳镇同义社区拉法基大道3号,611833', 'province': '四川省', 'city': '都江堰市' } },
          { 'lng': 120.19586600, 'lat': 30.09525500, 'metadata': { 'name': '杭州萧山时代骏宝行汽车销售服务有限公司', 'address': '浙江省杭州市萧山区义桥镇时代大道6188号,310000', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 116.33896700, 'lat': 27.96136800, 'metadata': { 'name': '抚州市宝晋汽车销售服务有限公司', 'address': '江西省抚州市高新技术产业开发区迎宾大道1879号,344000', 'province': '江西省', 'city': '抚州市' } },
          { 'lng': 116.10631200, 'lat': 39.72548600, 'metadata': { 'name': '北京汇宝行汽车销售服务有限公司', 'address': '北京市房山区阎村镇阎村桥东京周公路南侧,102400', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 113.85688882, 'lat': 23.01605867, 'metadata': { 'name': '东莞市宏宝汽车销售服务有限公司', 'address': '广东省东莞市寮步镇香市路东莞国际汽车城内邮编：523407', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 117.19028323, 'lat': 34.18089784, 'metadata': { 'name': '徐州宝景汽车销售服务有限公司', 'address': '江苏省徐州市铜山经济开发区206国道东北京路292号邮编：221000', 'province': '江苏省', 'city': '徐州市' } },
          { 'lng': 118.26886400, 'lat': 39.64392400, 'metadata': { 'name': '唐山中宝汽车销售服务有限公司', 'address': '河北省唐山市开平区开越路566号,063000', 'province': '河北省', 'city': '唐山市' } },
          { 'lng': 119.84930100, 'lat': 32.22243800, 'metadata': { 'name': '扬中宝德汽车服务有限公司', 'address': '江苏省扬中市扬中大道普济段528号,212200', 'province': '江苏省', 'city': '扬中市' } },
          { 'lng': 118.01621700, 'lat': 24.49391753, 'metadata': { 'name': '厦门中宝汽车有限公司', 'address': '福建省厦门市海沧区马青路1267号邮编361026', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 118.53993102, 'lat': 24.87155760, 'metadata': { 'name': '泉州福宝汽车销售服务有限公司', 'address': '福建省泉州市鲤城区常泰路3号,362000', 'province': '福建省', 'city': '泉州市' } },
          { 'lng': 116.20761200, 'lat': 39.92415600, 'metadata': { 'name': '北京骏宝行汽车销售服务有限公司', 'address': '北京市石景山区时代花园南路30号,100043', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 115.49940100, 'lat': 38.82329600, 'metadata': { 'name': '保定轩宇珪宝汽车维修服务有限公司', 'address': '保定市莲池区南二环路2100号，071000', 'province': '河北省', 'city': '保定市' } },
          { 'lng': 114.11787700, 'lat': 22.57479200, 'metadata': { 'name': '深圳宝泰行汽车销售服务有限公司笋岗分公司', 'address': '广东省深圳市罗湖区宝岗路218号，518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 115.47525100, 'lat': 38.91242200, 'metadata': { 'name': '保定轩之宝汽车销售服务有限公司', 'address': '河北省保定市高开区朝阳北大街1255号邮编071000', 'province': '河北省', 'city': '保定市' } },
          { 'lng': 115.85528100, 'lat': 28.66874200, 'metadata': { 'name': '南昌万宝行汽车销售服务有限公司', 'address': '江西省南昌市红谷滩新区红谷南大道2991号邮编330038', 'province': '江西省', 'city': '南昌市' } },
          { 'lng': 113.73627923, 'lat': 34.75007587, 'metadata': { 'name': '河南中德宝汽车销售服务有限公司', 'address': '河南省郑州市郑汴路与中州大道交叉口向东200米路南', 'province': '河南省', 'city': '郑州市' } },
          { 'lng': 118.17846100, 'lat': 24.48704100, 'metadata': { 'name': '厦门星德宝汽车贸易有限公司', 'address': '福建省厦门市思明区前埔西三路288号,361008', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 113.59246800, 'lat': 34.75254800, 'metadata': { 'name': '郑州中升之宝汽车销售服务有限公司', 'address': '河南省郑州市中原区西三环与中原路交叉口向东30米路南', 'province': '河南省', 'city': '郑州市' } },
          { 'lng': 119.36602200, 'lat': 26.08848700, 'metadata': { 'name': '福州新盈宝汽车服务有限公司', 'address': '福建省福州市晋安区鼓山镇,350001', 'province': '福建省', 'city': '福州市' } },
          { 'lng': 116.40022600, 'lat': 39.86152100, 'metadata': { 'name': '北京博瑞宝汽车销售服务有限公司', 'address': '北京市丰台区西罗园南里44号,100068', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 121.12701600, 'lat': 31.18166900, 'metadata': { 'name': '上海德宝北青汽车服务有限公司', 'address': '上海市青浦区外青松公路5388号.201707', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 114.40322300, 'lat': 23.13559000, 'metadata': { 'name': '惠州中升之宝汽车销售服务有限公司', 'address': '广东省惠州市惠博大道金山汽车城一路1A号，516000', 'province': '广东省', 'city': '惠州市' } },
          { 'lng': 120.79953700, 'lat': 27.84146400, 'metadata': { 'name': '温州力天之宝二手车销售有限公司', 'address': '温州市龙湾区经济技术开发区滨海园区201，325000', 'province': '浙江省', 'city': '温州市' } },
          { 'lng': 117.45096400, 'lat': 31.82881500, 'metadata': { 'name': '合肥众国宝泓汽车销售服务有限公司', 'address': '安徽省合肥市肥东县学府路与东华路交口,231600', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 113.26042000, 'lat': 23.25842000, 'metadata': { 'name': '广州君宝汽车销售服务有限公司', 'address': '广州市白云区广花一路136-1号,510440', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 106.32899300, 'lat': 38.54905200, 'metadata': { 'name': '宁夏金润宝汽车销售服务有限公司', 'address': '宁夏银川市德胜工业园区109国道东侧53号，750200', 'province': '宁夏回族自治区', 'city': '银川市' } },
          { 'lng': 122.22956500, 'lat': 43.65413100, 'metadata': { 'name': '通辽宝翔行汽车销售服务有限公司', 'address': '内蒙古通辽经济技术开发区辽河街道十三街坊', 'province': '内蒙古自治区', 'city': '通辽市' } },
          { 'lng': 116.42976300, 'lat': 40.12595000, 'metadata': { 'name': '北京宝晋行汽车销售服务有限公司', 'address': '北京市昌平区北七家镇瑶光路8号，102209', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '池州美宝行汽车销售服务有限公司', 'address': '安徽省池州市站前区国际汽车城1幢111号,247100', 'province': '安徽省', 'city': '池州市' } },
          { 'lng': 113.58657300, 'lat': 24.73713300, 'metadata': { 'name': '韶关粤宝汽车销售服务有限公司', 'address': '广东省韶关市浈江区韶南大道18号', 'province': '广东省', 'city': '韶关市' } },
          { 'lng': 109.95343000, 'lat': 40.60015500, 'metadata': { 'name': '包头市烨德宝汽车销售服务有限公司', 'address': '内蒙古自治区包头市九原区沙河镇210国道与哈屯高勒路交叉口南500米庞大汽车园内,014060', 'province': '内蒙古自治区', 'city': '包头市' } },
          { 'lng': 113.24026400, 'lat': 22.85831100, 'metadata': { 'name': '佛山市盛宝行汽车销售服务有限公司---大良分公司', 'address': '广东省佛山市顺德区大良广珠公路新松路段29号', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '楚雄路宝行汽车销售服务有限公司', 'address': '云南省楚雄市G320国道滇中大商汇二期113号', 'province': '云南省', 'city': '楚雄市' } },
          { 'lng': 113.20054000, 'lat': 23.15317300, 'metadata': { 'name': '广东粤宝汽车销售服务有限公司-第四分公司', 'address': '广东省广州市白云区沙凤三路4号101之D102、D104房，510168', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 116.64271900, 'lat': 23.41545900, 'metadata': { 'name': '汕头市宝泽汽车销售服务有限公司', 'address': '广东省汕头市金平区大学路300号之A单元，515000', 'province': '广东省', 'city': '汕头市' } },
          { 'lng': 118.70841000, 'lat': 25.01939600, 'metadata': { 'name': '泉州惠宝汽车销售服务有限公司', 'address': '福建省泉州市惠安黄塘高速出口直行500米处，362100', 'province': '福建省', 'city': '泉州市' } },
          { 'lng': 106.72579200, 'lat': 26.56791600, 'metadata': { 'name': '贵州通源宝源汽车服务有限公司', 'address': '贵州省贵阳市南明区新华路194号.550005', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 113.07463200, 'lat': 28.24394600, 'metadata': { 'name': '长沙宝诚汽车销售服务有限公司', 'address': '湖南省长沙市长沙县湘龙街道中南汽车世界MN区03栋，410199', 'province': '湖南省', 'city': '长沙市' } },
          { 'lng': 119.26324801, 'lat': 26.05828782, 'metadata': { 'name': '福建中升之宝汽车销售服务有限公司', 'address': '福建省福州市仓山区金山金达路71号，350008', 'province': '福建省', 'city': '福州市' } },
          { 'lng': 117.65481700, 'lat': 26.30109400, 'metadata': { 'name': '三明信达通宝汽车销售服务有限公司', 'address': '福建省三明市梅列区翁墩城市物流园邮编：365000', 'province': '福建省', 'city': '三明市' } },
          { 'lng': 114.44517147, 'lat': 38.02161058, 'metadata': { 'name': '石家庄宝翔行汽车销售服务有限公司', 'address': '河北省石家庄市桥西区西二环南路189-8号邮编：050092', 'province': '河北省', 'city': '石家庄市' } },
          { 'lng': 113.06476710, 'lat': 25.78571817, 'metadata': { 'name': '郴州瑞宝汽车销售服务有限公司', 'address': '湖南省郴州市郴江路39号邮编423000', 'province': '湖南省', 'city': '郴州市' } },
          { 'lng': 126.65322580, 'lat': 45.65840043, 'metadata': { 'name': '哈尔滨中宝汽车销售服务有限公司', 'address': '黑龙江省哈尔滨市南岗区哈平路154-20号邮编150081', 'province': '黑龙江省', 'city': '哈尔滨市' } },
          { 'lng': 103.86808159, 'lat': 36.08539304, 'metadata': { 'name': '兰州金瑞宝汽车销售服务有限公司', 'address': '甘肃省兰州市城关区盐场路红柳滩2号邮编730046', 'province': '甘肃省', 'city': '兰州市' } },
          { 'lng': 120.21827900, 'lat': 31.62057800, 'metadata': { 'name': '无锡信宝行汽车销售服务有限公司', 'address': '江苏省无锡市惠山区钱桥大道16号214151', 'province': '江苏省', 'city': '无锡市' } },
          { 'lng': 116.95601468, 'lat': 25.10724777, 'metadata': { 'name': '龙岩中宝汽车有限公司', 'address': '福建省龙岩市新罗区龙门镇物流大道336号邮编：364015', 'province': '福建省', 'city': '龙岩市' } },
          { 'lng': 125.40211409, 'lat': 43.86300925, 'metadata': { 'name': '长春宝兴行汽车销售服务有限公司', 'address': '吉林省长春市经济技术开发区东环城路10043号邮编130033', 'province': '吉林省', 'city': '长春市' } },
          { 'lng': 118.53993102, 'lat': 24.87155760, 'metadata': { 'name': '泉州福宝汽车销售服务有限公司-清濛分公司', 'address': '泉州市经济技术开发区迎宾大道鸿盛汽车城内', 'province': '福建省', 'city': '泉州市' } },
          { 'lng': 107.88596400, 'lat': 26.52914800, 'metadata': { 'name': '贵州凯里经济开发区宝源汽车销售服务有限公司', 'address': '贵州省黔东南苗族侗族自治州凯里市经济开发区凯里经济开区开元大道33号,556000', 'province': '贵州省', 'city': '凯里市' } },
          { 'lng': 119.94595643, 'lat': 30.10037665, 'metadata': { 'name': '杭州富阳宝信汽车销售服务有限公司', 'address': '杭州市富阳区银湖街道金桥北路957号311400', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 112.93448487, 'lat': 27.93418113, 'metadata': { 'name': '湘潭宝泽汽车销售服务有限公司', 'address': '湖南省湘潭市九华经济示范区湘望路5号', 'province': '湖南省', 'city': '湘潭市' } },
          { 'lng': 120.16761880, 'lat': 30.89035430, 'metadata': { 'name': '湖州宝景汽车销售服务有限公司', 'address': '浙江省湖州市吴兴区湖织大道818号,313000', 'province': '浙江省', 'city': '湖州市' } },
          { 'lng': 121.53301900, 'lat': 31.08485200, 'metadata': { 'name': '上海宝尊汽车服务有限公司', 'address': '上海市闵行区浦江镇联航路1297号', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 108.30829635, 'lat': 22.82425781, 'metadata': { 'name': '南宁市粤宝汽车销售服务有限公司', 'address': '广西省南宁市西乡塘区永和路8号邮编：530011', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 115.84613200, 'lat': 28.73272400, 'metadata': { 'name': '南昌宝泽汽车销售服务有限公司', 'address': '江西省南昌市经济技术开发区玉屏东大道环球公园旁，330013', 'province': '江西省', 'city': '南昌市' } },
          { 'lng': 110.25918736, 'lat': 20.00208253, 'metadata': { 'name': '海南宝悦汽车销售服务有限公司', 'address': '海南省海口市秀英区南海大道137号邮编570216', 'province': '海南省', 'city': '海口市' } },
          { 'lng': 114.10936100, 'lat': 30.62253700, 'metadata': { 'name': '武汉运通益宝汽车销售服务有限公司', 'address': '湖北省武汉市东西湖区东西湖大道5888号430040', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 114.55801200, 'lat': 37.12634200, 'metadata': { 'name': '邢台宝鹏汽车销售服务有限公司', 'address': '河北省邢台市邢台县龙岗大街东段汽车园区2号店', 'province': '河北省', 'city': '邢台市' } },
          { 'lng': 121.50833800, 'lat': 31.35639300, 'metadata': { 'name': '上海宝诚中环汽车销售服务有限公司军工路分公司', 'address': '上海市宝山区逸仙路3718号C01-04', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 117.82873900, 'lat': 41.02092300, 'metadata': { 'name': '承德美宝行汽车销售服务有限公司', 'address': '河北省承德市双滦区双塔山镇单塔子村松狮县公路南侧', 'province': '河北省', 'city': '承德市' } },
          { 'lng': 112.88467300, 'lat': 35.47631700, 'metadata': { 'name': '晋城宝利华汽车销售服务有限公司', 'address': '山西省晋城市文峰路6号，048000', 'province': '山西省', 'city': '晋城市' } },
          { 'lng': 117.99630500, 'lat': 36.68200900, 'metadata': { 'name': '淄博博宝行汽车销售服务有限公司', 'address': '山东省淄博市淄川立交桥北888米路东,255100', 'province': '山东省', 'city': '淄博市' } },
          { 'lng': 125.37451289, 'lat': 43.85401032, 'metadata': { 'name': '长春宝悦行汽车维修服务有限公司', 'address': '吉林省长春市经济技术开发区临河街6373号', 'province': '吉林省', 'city': '长春市' } },
          { 'lng': 119.62284591, 'lat': 32.03624123, 'metadata': { 'name': '丹阳宝德汽车销售服务有限公司', 'address': '丹阳市开发大道10号邮编：212314', 'province': '江苏省', 'city': '丹阳市' } },
          { 'lng': 120.72523100, 'lat': 31.32456000, 'metadata': { 'name': '苏州宝信汽车销售服务有限公司', 'address': '江苏省苏州市吴中区吴东路2588号邮编215124', 'province': '江苏省', 'city': '苏州市' } },
          { 'lng': 120.06286142, 'lat': 29.31881341, 'metadata': { 'name': '义乌市信宝行汽车销售服务有限公司', 'address': '浙江省义乌市雪峰西路296号邮编322000', 'province': '浙江省', 'city': '义乌市' } },
          { 'lng': 121.25150400, 'lat': 28.20972400, 'metadata': { 'name': '玉环力宝行汽车销售服务有限公司', 'address': '浙江省玉环经济开发区漩港北路88号', 'province': '浙江省', 'city': '玉环市' } },
          { 'lng': 112.57350812, 'lat': 26.91772350, 'metadata': { 'name': '衡阳市美宝行汽车销售服务有限公司', 'address': '湖南省衡阳市蒸湘区外环西路杨柳汽车城二期1号', 'province': '湖南省', 'city': '衡阳市' } },
          { 'lng': 105.57940000, 'lat': 30.45822500, 'metadata': { 'name': '遂宁长宝汽车销售服务有限公司', 'address': '四川省遂宁市船山区中国西部现代物流港内汽车产业园内,629000', 'province': '四川省', 'city': '遂宁市' } },
          { 'lng': 109.00555600, 'lat': 34.16137500, 'metadata': { 'name': '西安中宝汽车销售服务有限公司', 'address': '西安市航天基地东长安街966号', 'province': '陕西省', 'city': '西安市' } },
          { 'lng': 120.43503700, 'lat': 36.24475300, 'metadata': { 'name': '青岛宝景汽车销售服务有限公司', 'address': '山东省青岛市城阳区源水路888号，264000', 'province': '山东省', 'city': '青岛市' } },
          { 'lng': 113.26839300, 'lat': 35.15188100, 'metadata': { 'name': '焦作市东宝行汽车销售服务有限公司', 'address': '河南省焦作市迎宾大道', 'province': '河南省', 'city': '焦作市' } },
          { 'lng': 109.48134400, 'lat': 34.52050900, 'metadata': { 'name': '渭南市宗申宝泰汽车销售服务有限公司', 'address': '陕西省渭南市高新区乐天大街西段与新盛路十字向西200米路南', 'province': '陕西省', 'city': '渭南市' } },
          { 'lng': 116.49564600, 'lat': 39.96445800, 'metadata': { 'name': '北京宝信行汽车销售服务有限公司', 'address': '北京市朝阳区将台乡安家楼西十里67号100016', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 121.51484600, 'lat': 29.86019400, 'metadata': { 'name': '宁波运通宝晟汽车销售服务有限公司', 'address': '浙江省宁波市环城南路西段2558号（与机场路交汇口）315176', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 102.96248400, 'lat': 29.99533300, 'metadata': { 'name': '雅安裕孚宝汽车销售服务有限公司', 'address': '四川省雅安市雨城区多营镇茶马大道115号，625000', 'province': '四川省', 'city': '雅安市' } },
          { 'lng': 107.51190000, 'lat': 31.19607000, 'metadata': { 'name': '达州宝远汽车销售服务有限公司', 'address': '四川省达州市达县南外镇南化大道，635000', 'province': '四川省', 'city': '达州市' } },
          { 'lng': 119.43822700, 'lat': 35.39914000, 'metadata': { 'name': '日照宝景汽车销售服务有限公司', 'address': '山东省日照市日照市奎山汽车城204国道包头路南、长沙路东276800', 'province': '山东省', 'city': '日照市' } },
          { 'lng': 121.57895500, 'lat': 29.90560300, 'metadata': { 'name': '宁波宝信汽车销售服务有限公司', 'address': '浙江省宁波市江北区环城北路东段83号邮编315020', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 120.27593413, 'lat': 30.22040910, 'metadata': { 'name': '杭州宝信汽车销售服务有限公司', 'address': '浙江省杭州市萧山区市心北路589号邮编311200', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 115.72079800, 'lat': 37.79273200, 'metadata': { 'name': '衡水威宝汽车销售服务有限公司', 'address': '河北省衡水市桃城区振华路与冀衡路交叉口西南角，053000', 'province': '河北省', 'city': '衡水市' } },
          { 'lng': 101.65571000, 'lat': 36.52533500, 'metadata': { 'name': '西宁金岛新宝行汽车销售服务有限公司', 'address': '青海省西宁市城中区同安路182号，810000', 'province': '青海省', 'city': '西宁市' } },
          { 'lng': 120.17832000, 'lat': 36.02296500, 'metadata': { 'name': '青岛大友宝汽车销售服务有限公司', 'address': '山东省青岛市黄岛区江山中路189号，266599', 'province': '山东省', 'city': '青岛市' } },
          { 'lng': 112.22783900, 'lat': 30.36165500, 'metadata': { 'name': '荆州恒信宝汽车销售服务有限公司', 'address': '湖北省荆州市荆州区荆沙大道恒信汽车市场，434000', 'province': '湖北省', 'city': '荆州市' } },
          { 'lng': 112.58144400, 'lat': 32.95739700, 'metadata': { 'name': '南阳恒信宝汽车销售服务有限公司', 'address': '南阳市雪枫路与南新路交叉口东600米，473000', 'province': '河南省', 'city': '南阳市' } },
          { 'lng': 106.56624800, 'lat': 29.48379000, 'metadata': { 'name': '重庆运通欣宝汽车销售服务有限公司', 'address': '重庆市巴南区渝南分流道20号,400054', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 108.95976000, 'lat': 34.37593200, 'metadata': { 'name': '西安运通博宝汽车销售服务有限公司', 'address': '陕西省西安市未央区西黄高速与北三环辅道交口西北150米，710021', 'province': '陕西省', 'city': '西安市' } },
          { 'lng': 120.43513311, 'lat': 36.14989654, 'metadata': { 'name': '青岛中达燕京汽车销售服务有限公司', 'address': '山东省青岛市李沧区黑龙江中路838号,266100', 'province': '山东省', 'city': '青岛市' } },
          { 'lng': 114.48380818, 'lat': 36.62273557, 'metadata': { 'name': '邯郸市宝和汽车销售服务有限公司', 'address': '河北省邯郸市复兴区北环路88号现代汽贸城内,056000', 'province': '河北省', 'city': '邯郸市' } },
          { 'lng': 120.72287800, 'lat': 30.73770200, 'metadata': { 'name': '嘉兴之宝汽车销售服务有限公司', 'address': '浙江省嘉兴市华严路393号', 'province': '浙江省', 'city': '嘉兴市' } },
          { 'lng': 104.04018708, 'lat': 30.63443809, 'metadata': { 'name': '成都中宝汽车销售服务有限公司---红牌楼分公司', 'address': '四川省成都市武侯区丽都路2号附1号', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 103.98029800, 'lat': 30.61030600, 'metadata': { 'name': '成都鼎宝行二手车销售服务有限公司', 'address': '四川省成都市武侯区成双大道中段968号,610045', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 118.16409100, 'lat': 25.08033900, 'metadata': { 'name': '安溪金宝汽车销售服务有限公司', 'address': '福建省泉州市安溪县城厢镇二环北路1188号,362400', 'province': '福建省', 'city': '泉州市' } },
          { 'lng': 113.80475700, 'lat': 34.75037200, 'metadata': { 'name': '郑州恒信宝汽车销售服务有限公司', 'address': '河南省郑州市郑东新区商都路与潭南街交叉口向北300米路东,450000', 'province': '河南省', 'city': '郑州市' } },
          { 'lng': 113.77023500, 'lat': 23.28729700, 'metadata': { 'name': '广州美宝行汽车销售服务有限公司', 'address': '广东省广州市增城区增城大道515号,511300', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 113.74690213, 'lat': 23.00902083, 'metadata': { 'name': '东莞市合宝汽车销售服务有限公司', 'address': '广东省东莞市南城区宏图路138号邮编523009', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 117.25904900, 'lat': 39.12822800, 'metadata': { 'name': '天津天宝汽车销售服务有限公司河东分公司', 'address': '天津市河东区上杭路琳科中路101号,300161', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 87.63268200, 'lat': 43.95356100, 'metadata': { 'name': '乌鲁木齐燕德宝汽车销售服务有限公司', 'address': '乌鲁木齐市永顺街1599号,830000', 'province': '新疆维吾尔自治区', 'city': '乌鲁木齐市' } },
          { 'lng': 116.67238600, 'lat': 39.48976800, 'metadata': { 'name': '廊坊市冠宝行汽车销售服务有限公司', 'address': '河北省廊坊市安次区安次高新技术产业园西昌路西侧、安锦道南侧，06500', 'province': '河北省', 'city': '廊坊市' } },
          { 'lng': 121.36111901, 'lat': 31.29872535, 'metadata': { 'name': '上海众国宝泓汽车销售服务有限公司', 'address': '上海市普陀区红柳路233号邮编：200331', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 112.86652900, 'lat': 28.20944200, 'metadata': { 'name': '长沙中升之宝汽车销售服务有限公司', 'address': '湖南省长沙市嘉运路6号，401205', 'province': '湖南省', 'city': '长沙市' } },
          { 'lng': 120.63369100, 'lat': 31.41776300, 'metadata': { 'name': '苏州骏宝行汽车销售服务有限公司第一分公司', 'address': '江苏省苏州市相城区太阳路2588号', 'province': '江苏省', 'city': '苏州市' } },
          { 'lng': 118.24524400, 'lat': 24.68986600, 'metadata': { 'name': '厦门锦宝汽车销售服务有限公司', 'address': '厦门市翔安区民安大道2801之一邮编361100', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 116.85203000, 'lat': 38.35157900, 'metadata': { 'name': '沧州轩之宝汽车销售服务有限公司', 'address': '河北省沧州市运河区浮阳北大道运河工业园区轩宇汽车园区4号，061000', 'province': '河北省', 'city': '沧州市' } },
          { 'lng': 116.36508500, 'lat': 40.02434300, 'metadata': { 'name': '北京中升宝辉汽车销售服务有限公司', 'address': '北京市朝阳区德胜门外花虎沟18号,100192', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 117.90905078, 'lat': 28.46146449, 'metadata': { 'name': '上饶市宝泽汽车销售服务有限公司', 'address': '江西省上饶市三清山西大道58号月亮湾汽车城,334100', 'province': '江西省', 'city': '上饶市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '苍南宝晟汽车服务有限公司', 'address': '浙江省苍南县龙港镇世纪大道2800-2862号一层A区', 'province': '浙江省', 'city': '苍南市' } },
          { 'lng': 118.26387400, 'lat': 35.13462400, 'metadata': { 'name': '临沂通宝行汽车销售服务有限公司', 'address': '山东省临沂市兰山区双岭路与俄黄路交汇处路南，276000', 'province': '山东省', 'city': '临沂市' } },
          { 'lng': 119.79230727, 'lat': 31.38221540, 'metadata': { 'name': '宜兴宝利丰汽车销售服务有限公司', 'address': '江苏宜兴经济开发区融达汽车城16号邮编214201', 'province': '江苏省', 'city': '宜兴市' } },
          { 'lng': 114.00562835, 'lat': 22.53442275, 'metadata': { 'name': '深圳宝源行汽车销售服务有限公司', 'address': '深圳市福田区福田汽车站福安大厦南楼一、二层,518040', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 120.80420117, 'lat': 31.64319104, 'metadata': { 'name': '常熟宝业行二手车中心有限公司', 'address': '江苏省常熟市虞山镇长安路9号,215500', 'province': '江苏省', 'city': '常熟市' } },
          { 'lng': 116.95295271, 'lat': 38.30145330, 'metadata': { 'name': '沧州市浩宝汽车销售服务有限公司', 'address': '河北省沧州市经济开发区石港路50号,061000', 'province': '河北省', 'city': '沧州市' } },
          { 'lng': 104.01685200, 'lat': 30.63071900, 'metadata': { 'name': '成都运通御宝汽车销售服务有限公司', 'address': '四川省成都市武侯区星狮路600号,610043', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 123.78444999, 'lat': 41.85821168, 'metadata': { 'name': '抚顺汇之宝汽车销售服务有限公司', 'address': '辽宁省抚顺市望花区丹东西路59号邮编：113122', 'province': '辽宁省', 'city': '抚顺市' } },
          { 'lng': 120.68179212, 'lat': 31.18425717, 'metadata': { 'name': '吴江宝致汽车销售服务有限公司', 'address': '江苏省苏州市吴江区松陵镇泾陵路177号，215200', 'province': '江苏省', 'city': '吴江市' } },
          { 'lng': 122.06364900, 'lat': 41.16181300, 'metadata': { 'name': '盘锦华宝汽车销售服务有限公司', 'address': '辽宁省盘锦市经济开发区工业大街16号邮编124013', 'province': '辽宁省', 'city': '盘锦市' } },
          { 'lng': 114.55577409, 'lat': 38.07872920, 'metadata': { 'name': '石家庄宝和汽车销售服务有限公司', 'address': '河北省石家庄市长安区北二环东路86号,050021', 'province': '河北省', 'city': '石家庄市' } },
          { 'lng': 113.32774212, 'lat': 23.03135278, 'metadata': { 'name': '广州宝悦汽车贸易有限公司', 'address': '广东省广州市番禺区大石街迎宾路628号，511430', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 109.45929458, 'lat': 24.31608704, 'metadata': { 'name': '柳州市粤宝汽车销售服务有限公司', 'address': '广西壮族自治区柳州市鱼峰区西江路26号邮编545006', 'province': '广西壮族自治区', 'city': '柳州市' } },
          { 'lng': 113.41746074, 'lat': 22.55493190, 'metadata': { 'name': '中山市合宝汽车销售服务有限公司', 'address': '中山市东区长江北路白沙湾工业区328号', 'province': '广东省', 'city': '中山市' } },
          { 'lng': 118.36558379, 'lat': 27.05689218, 'metadata': { 'name': '南平信达通宝汽车销售服务有限公司', 'address': '福建省建瓯市中国笋竹城C区8号（东门高速路口）邮编：353100', 'province': '福建省', 'city': '南平市' } },
          { 'lng': 110.11215300, 'lat': 39.79863900, 'metadata': { 'name': '鄂尔多斯市顺宝行汽车销售服务有限公司', 'address': '内蒙古自治区鄂尔多斯市铜川镇汽车博览园邮编017009', 'province': '内蒙古自治区', 'city': '鄂尔多斯市' } },
          { 'lng': 121.47113029, 'lat': 29.36760834, 'metadata': { 'name': '宁海宝信汽车销售服务有限公司', 'address': '浙江省宁波市宁海县梅林街道平安西路2号,315600', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 119.97376900, 'lat': 32.53287000, 'metadata': { 'name': '泰州宝景汽车销售服务有限公司', 'address': '江苏省泰州市海陵区京泰路街道兴泰路69号', 'province': '江苏省', 'city': '泰州市' } },
          { 'lng': 112.26067219, 'lat': 32.12213203, 'metadata': { 'name': '襄阳宝泽汽车销售服务有限公司', 'address': '中国湖北省襄阳市经济技术开发区深圳工业园A39邮编：441100', 'province': '湖北省', 'city': '襄阳市' } },
          { 'lng': 123.50983900, 'lat': 41.81929100, 'metadata': { 'name': '沈阳华宝汽车销售服务有限公司大东分公司', 'address': '辽宁省沈阳市大东区东陵西路4号47幢邮编：110025', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 119.61241900, 'lat': 32.43959300, 'metadata': { 'name': '扬州宝华汽车销售服务有限公司', 'address': '江苏省扬州市江都区长江路江都国际汽车城', 'province': '江苏省', 'city': '扬州市' } },
          { 'lng': 113.66723152, 'lat': 22.90229351, 'metadata': { 'name': '东莞市骅宝汽车销售服务有限公司', 'address': '广东省东莞市厚街镇莞太路溪头段邮编：523960', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 122.14141405, 'lat': 37.37708927, 'metadata': { 'name': '威海宝通汽车销售服务有限公司', 'address': '山东省威海市环翠区温泉西路117号金蚂蚁汽车广场，264206', 'province': '山东省', 'city': '威海市' } },
          { 'lng': 102.71622548, 'lat': 25.05151470, 'metadata': { 'name': '云南宝悦汽车贸易有限公司', 'address': '云南省昆明市盘龙区东三环北段虹桥立交桥旁邮编：650000', 'province': '云南省', 'city': '昆明市' } },
          { 'lng': 112.94784471, 'lat': 28.14365118, 'metadata': { 'name': '长沙宝悦汽车服务有限公司', 'address': '湖南省长沙市岳麓区猴子石大桥西头二环线南侧（阳光壹佰国际新城对面）邮编：410083', 'province': '湖南省', 'city': '长沙市' } },
          { 'lng': 108.31097282, 'lat': 22.78264832, 'metadata': { 'name': '南宁中达桂宝汽车服务有限公司', 'address': '广西省南宁市白沙大道130号邮编530031', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 113.69655200, 'lat': 34.72595900, 'metadata': { 'name': '郑州华德宝汽车销售服务有限公司', 'address': '河南省郑州市航海路与城东路交叉口西南角450000', 'province': '河南省', 'city': '郑州市' } },
          { 'lng': 106.60213400, 'lat': 30.45557700, 'metadata': { 'name': '广安市宗申宝泰汽车销售服务有限公司', 'address': '四川省广安市枣山物流商贸园区天成村二组638500', 'province': '四川省', 'city': '广安市' } },
          { 'lng': 106.51573600, 'lat': 26.56883500, 'metadata': { 'name': '贵阳瀚羿睿宝汽车销售服务有限公司', 'address': '贵州省贵阳市清镇汽车贸易城551417', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 114.25431630, 'lat': 30.55019527, 'metadata': { 'name': '武汉汉德宝汽车销售服务有限公司', 'address': '武汉市汉阳区马沧湖路176-1号', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 120.26140000, 'lat': 31.91423600, 'metadata': { 'name': '江阴享悦宝诚汽车销售服务有限公司', 'address': '江阴市五星路1688-1号邮编：214400', 'province': '江苏省', 'city': '江阴市' } },
          { 'lng': 103.81425400, 'lat': 30.08085600, 'metadata': { 'name': '眉山长宝汽车销售服务有限公司', 'address': '四川省眉山市经济开发区新区兴业路南段10号', 'province': '四川省', 'city': '眉山市' } },
          { 'lng': 113.89535950, 'lat': 33.98827619, 'metadata': { 'name': '许昌宝莲沅汽车销售服务有限公司', 'address': '河南省许昌市南外环市车管所东500米', 'province': '河南省', 'city': '许昌市' } },
          { 'lng': 109.73115410, 'lat': 38.22992741, 'metadata': { 'name': '陕西榆林金麒宝汽车销售服务有限公司', 'address': '陕西省榆林市开发区草海则电厂路，719000', 'province': '陕西省', 'city': '榆林市' } },
          { 'lng': 106.57113578, 'lat': 29.64461319, 'metadata': { 'name': '重庆宝渝汽车销售服务（集团）有限公司', 'address': '重庆市北部新区金童路2号邮编401121', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 117.15134704, 'lat': 31.87164058, 'metadata': { 'name': '合肥中升之宝汽车销售服务有限公司', 'address': '合肥市蜀山区湖光路1666号邮编:230031', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 120.52663313, 'lat': 30.12948401, 'metadata': { 'name': '绍兴宝晨汽车销售服务有限公司', 'address': '浙江省绍兴柯北金柯桥大道2899号邮编：312080', 'province': '浙江省', 'city': '绍兴市' } },
          { 'lng': 113.09914804, 'lat': 27.84138360, 'metadata': { 'name': '株洲市美宝行汽车销售服务有限公司', 'address': '湖南省株洲市天元区株洲大道688号邮编：412007', 'province': '湖南省', 'city': '株洲市' } },
          { 'lng': 120.73469259, 'lat': 27.98510105, 'metadata': { 'name': '温州市好达机电有限公司', 'address': '浙江省温州市经济技术开发区温州大道458号邮编325011', 'province': '浙江省', 'city': '温州市' } },
          { 'lng': 105.96148700, 'lat': 32.38366600, 'metadata': { 'name': '广元得孚宝汽车销售服务有限公司', 'address': '四川省广元市昭化区工业发展集中区.邮编：628000', 'province': '四川省', 'city': '广元市' } },
          { 'lng': 113.81467018, 'lat': 23.08357742, 'metadata': { 'name': '东莞市顺宝汽车销售服务有限公司', 'address': '东莞市东城区莞龙路柏洲边路段邮编：523115', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 116.43023500, 'lat': 39.74093900, 'metadata': { 'name': '北京运通兴宝汽车销售服务有限公司', 'address': '北京市大兴区西红门镇中鼎路19号，100176', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 117.71063900, 'lat': 39.04199700, 'metadata': { 'name': '天津荣宝行汽车销售服务有限公司', 'address': '天津市经济技术开发区第五大街59号，300457', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 114.06014800, 'lat': 33.01817000, 'metadata': { 'name': '驻马店市驿宝行汽车销售服务有限公司', 'address': '河南省驻马店市开源大道与前进大道交叉口东100米，463000', 'province': '河南省', 'city': '驻马店市' } },
          { 'lng': 113.35338286, 'lat': 23.08590253, 'metadata': { 'name': '广州市广德宝汽车销售服务有限公司', 'address': '广东省广州市海珠区新滘中路华洲路路口510310', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 104.69218500, 'lat': 30.11022300, 'metadata': { 'name': '资阳锦孚宝汽车销售服务有限公司', 'address': '四川省资阳市雁江区城东新区迎宾大道东侧，城南大道北侧，641300', 'province': '四川省', 'city': '资阳市' } },
          { 'lng': 119.37897900, 'lat': 25.92445000, 'metadata': { 'name': '福建星德宝汽车销售服务有限公司', 'address': '福建省福州市闽侯县尚干镇青口海峡汽车文化广场C1，350112', 'province': '福建省', 'city': '福州市' } },
          { 'lng': 114.04622600, 'lat': 22.67554900, 'metadata': { 'name': '深圳宝泽汽车销售服务有限公司', 'address': '深圳市龙华新区和平路21号振华时代广场一楼，518109', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 120.10342500, 'lat': 31.78353600, 'metadata': { 'name': '常州常宝汽车销售服务有限公司', 'address': '江苏省常州市武进区横山桥镇汽车城', 'province': '江苏省', 'city': '常州市' } },
          { 'lng': 113.41385000, 'lat': 40.07080500, 'metadata': { 'name': '大同市顺宝行汽车销售服务有限公司', 'address': '山西省大同市开发区湖滨路33号邮编037300', 'province': '山西省', 'city': '大同市' } },
          { 'lng': 113.23135100, 'lat': 22.87312300, 'metadata': { 'name': '佛山市顺德合宝汽车销售服务有限公司', 'address': '佛山市顺德伦教广珠公路东侧即顺德立交桥北面528308', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 108.36416400, 'lat': 30.74209100, 'metadata': { 'name': '重庆市万州区宝渝汽车销售服务有限公司', 'address': '重庆市万州区经开大道66号,404001', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 126.54626446, 'lat': 45.70494545, 'metadata': { 'name': '哈尔滨中顺滨宝汽车销售服务有限公司', 'address': '黑龙江省哈尔滨市机场路161号,150400', 'province': '黑龙江省', 'city': '哈尔滨市' } },
          { 'lng': 114.04002800, 'lat': 22.54708500, 'metadata': { 'name': '深圳通源宝源汽车维修服务有限公司', 'address': '深圳市福田区香蜜湖联合华鹏汽车城A3片区，518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 114.04095900, 'lat': 22.56556800, 'metadata': { 'name': '深圳通源宝源汽车服务有限公司', 'address': '深圳市福田区梅林街道北环大道7014号，518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 114.24576006, 'lat': 30.73050764, 'metadata': { 'name': '武汉鄂宝汽车销售服务有限公司-M展厅', 'address': '湖北省武汉市盘龙城经济开发区盘龙汽车城，430312', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 118.46538700, 'lat': 31.38341800, 'metadata': { 'name': '芜湖众国宝泓汽车销售服务有限公司', 'address': '安徽省芜湖市鸠江区龙腾路63-1号，241000', 'province': '安徽省', 'city': '芜湖市' } },
          { 'lng': 113.49389400, 'lat': 23.16224700, 'metadata': { 'name': '广州宝升行汽车销售服务有限公司', 'address': '广东省广州市萝岗区科学城光谱东路转新桂路500米处，510530', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 114.24379800, 'lat': 34.80781600, 'metadata': { 'name': '开封汴德宝汽车销售服务有限公司', 'address': '河南省开封市郑开大道与第九大街交叉口向东30米路南,475000', 'province': '河南省', 'city': '开封市' } },
          { 'lng': 113.46350600, 'lat': 22.21359400, 'metadata': { 'name': '珠海中升之宝汽车销售服务有限公司', 'address': '广东省珠海市南屏科技工业园B4屏西三路1号', 'province': '广东省', 'city': '珠海市' } },
          { 'lng': 106.53992400, 'lat': 29.64344100, 'metadata': { 'name': '重庆宝创汽车销售服务有限公司', 'address': '重庆市金开大道15号', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 105.39620400, 'lat': 27.26773000, 'metadata': { 'name': '毕节佰润黔之宝汽车销售服务有限公司', 'address': '贵州毕节市双山新区碧阳大道小坝路口(佰润汽车广场)，551700', 'province': '贵州省', 'city': '毕节市' } },
          { 'lng': 111.60710298, 'lat': 40.82651555, 'metadata': { 'name': '呼和浩特市顺宝行汽车销售服务有限公司', 'address': '呼和浩特市回民区海拉尔西路289号邮编：010010', 'province': '内蒙古自治区', 'city': '呼和浩特市' } },
          { 'lng': 113.87889000, 'lat': 22.78095100, 'metadata': { 'name': '深圳市宝晋汽车销售服务有限公司', 'address': '广东省深圳市光明新区公明街道茨田埔西环路40号,518107', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 104.03740400, 'lat': 30.62984600, 'metadata': { 'name': '成都中宝快捷汽车服务有限公司', 'address': '武侯区二环路丽都路58号，610000', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 120.25300500, 'lat': 30.29629500, 'metadata': { 'name': '杭州金昌辰宝汽车销售服务有限公司', 'address': '浙江省杭州市江干区艮山东路170号，310017', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 119.92184500, 'lat': 31.02103900, 'metadata': { 'name': '湖州骏宝行汽车销售服务有限公司-长兴分公司', 'address': '浙江省湖州市长兴县太湖街道太湖东路1号,', 'province': '浙江省', 'city': '湖州市' } },
          { 'lng': 121.39564200, 'lat': 28.42482100, 'metadata': { 'name': '台州绿地宝仕汽车销售服务有限公司', 'address': '浙江省温岭市城东街道楼山村振业路1号,317500', 'province': '浙江省', 'city': '温岭市' } },
          { 'lng': 118.13541000, 'lat': 24.62413500, 'metadata': { 'name': '厦门威士宝汽车销售服务有限公司', 'address': '福建省厦门市同安区同集中路2号,361100', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 120.59246700, 'lat': 30.00236500, 'metadata': { 'name': '绍兴金昌之宝二手车销售服务有限公司', 'address': '浙江省绍兴市绍兴袍江中心大道201号101室312071', 'province': '浙江省', 'city': '绍兴市' } },
          { 'lng': 121.57122900, 'lat': 31.15765000, 'metadata': { 'name': '上海凡德汽车销售服务有限公司沪南路分公司', 'address': '上海市沪南路2502号', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 117.92679300, 'lat': 31.65320500, 'metadata': { 'name': '合肥众国宝之祥汽车销售服务有限公司', 'address': '安徽省合肥巢湖经济开发区金山路19号,238000', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 114.93029400, 'lat': 38.55505500, 'metadata': { 'name': '定州轩之宝汽车销售服务有限公司', 'address': '定州市军工路南侧（轩宇汽车园内），073000', 'province': '河北省', 'city': '定州市' } },
          { 'lng': 123.83240000, 'lat': 42.26728500, 'metadata': { 'name': '铁岭市宝丰行汽车销售服务有限公司', 'address': '辽宁省铁岭市银州区柴河街137号,112000', 'province': '辽宁省', 'city': '铁岭市' } },
          { 'lng': 115.61059000, 'lat': 33.22414100, 'metadata': { 'name': '太和县众国宝祥汽车销售服务有限公司', 'address': '安徽省阜阳市太和县经济开发区工业园区D区,236000', 'province': '安徽省', 'city': '阜阳市' } },
          { 'lng': 118.93302000, 'lat': 42.33037300, 'metadata': { 'name': '赤峰宝翔行汽车销售服务有限公司', 'address': '内蒙古赤峰市红山区桥北物流园区赤锡路129号', 'province': '内蒙古自治区', 'city': '赤峰市' } },
          { 'lng': 118.31571000, 'lat': 32.24891800, 'metadata': { 'name': '滁州美宝行汽车销售服务有限公司', 'address': '安徽省滁州市丰乐大道2769号，239000', 'province': '安徽省', 'city': '滁州市' } },
          { 'lng': 118.29681300, 'lat': 29.74114700, 'metadata': { 'name': '黄山美宝行汽车销售服务有限公司', 'address': '安徽省黄山市屯溪区东关路7号，245000', 'province': '安徽省', 'city': '黄山市' } },
          { 'lng': 121.20145893, 'lat': 41.12342064, 'metadata': { 'name': '锦州华宝汽车销售服务有限公司', 'address': '辽宁省锦州市解放东路20-1号,121000', 'province': '辽宁省', 'city': '锦州市' } },
          { 'lng': 119.97360571, 'lat': 31.70200723, 'metadata': { 'name': '常州宝尊汽车销售服务有限公司', 'address': '江苏省常州市武进区常漕路、延政路口武进汽车城区1号邮编213164', 'province': '江苏省', 'city': '常州市' } },
          { 'lng': 119.88942108, 'lat': 31.79374256, 'metadata': { 'name': '常州新宝尊汽车销售服务有限公司', 'address': '江苏省常州市钟楼开发区汽车服务中心A-01号邮编：213023', 'province': '江苏省', 'city': '常州市' } },
          { 'lng': 116.25428066, 'lat': 39.97974546, 'metadata': { 'name': '北京京宝行汽车销售服务有限公司', 'address': '北京市海淀区闵庄路19号邮编100195', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 113.28433514, 'lat': 23.18467844, 'metadata': { 'name': '广东粤宝汽车销售服务有限公司', 'address': '广东省广州市白云区白云大道南1115号邮编510420', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 108.36042700, 'lat': 22.86910300, 'metadata': { 'name': '南宁市粤宝汽车销售服务有限公司第一分公司', 'address': '广西壮族自治区南宁市兴宁区秀厢大道108号536000', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 108.68648000, 'lat': 34.37285200, 'metadata': { 'name': '咸阳宝源汽车销售服务有限公司', 'address': '陕西省咸阳市秦都区西兰路通源汽车文化广场，712000', 'province': '陕西省', 'city': '咸阳市' } },
          { 'lng': 118.97034979, 'lat': 28.97919058, 'metadata': { 'name': '衢州宝驿汽车销售服务有限公司', 'address': '浙江省衢州市衢江区振兴东路555号邮编：324000', 'province': '浙江省', 'city': '衢州市' } },
          { 'lng': 122.26969600, 'lat': 29.98710300, 'metadata': { 'name': '舟山宝驿汽车销售服务有限公司', 'address': '浙江省舟山市普陀区勾山街道新驰路77号', 'province': '浙江省', 'city': '舟山市' } },
          { 'lng': 113.55517700, 'lat': 22.38779000, 'metadata': { 'name': '珠海宝泽汽车销售服务有限公司', 'address': '广东省珠海市高新区金鼎金峰北路200号', 'province': '广东省', 'city': '珠海市' } },
          { 'lng': 104.00035507, 'lat': 30.71908347, 'metadata': { 'name': '成都宝悦汽车有限公司', 'address': '四川省成都市金牛区金科南路3号邮编610036', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 113.32036492, 'lat': 33.72402451, 'metadata': { 'name': '平顶山宝莲升汽车销售服务有限公司', 'address': '河南省平顶山市神马大道与新华路交叉口西500米路北邮编:467000', 'province': '河南省', 'city': '平顶山市' } },
          { 'lng': 118.71872800, 'lat': 30.93808100, 'metadata': { 'name': '宣城宝利丰汽车销售服务有限公司', 'address': '安徽省宣城经济技术开发区柏枧山路39号,242000', 'province': '安徽省', 'city': '宣城市' } },
          { 'lng': 110.83735300, 'lat': 32.65617900, 'metadata': { 'name': '十堰中顺宝汽车销售服务有限公司', 'address': '湖北省十堰市张湾区浙江路117-15号442011', 'province': '湖北省', 'city': '十堰市' } },
          { 'lng': 87.61399400, 'lat': 43.86205500, 'metadata': { 'name': '乌鲁木齐万宝行汽车销售服务有限公司', 'address': '新疆维吾尔族自治区乌鲁木齐市水磨沟区南湖北路848号友好汽车城内，830000', 'province': '新疆维吾尔自治区', 'city': '乌鲁木齐市' } },
          { 'lng': 120.55560000, 'lat': 32.36273800, 'metadata': { 'name': '如皋聚宝行汽车销售服务有限公司', 'address': '江苏省如皋市如城街道惠政西路28号226500', 'province': '江苏省', 'city': '如皋市' } },
          { 'lng': 117.02096500, 'lat': 30.56544600, 'metadata': { 'name': '安庆星之宝汽车销售服务有限公司', 'address': '安徽省安庆市丁香路北侧246005', 'province': '安徽省', 'city': '安庆市' } },
          { 'lng': 111.52298400, 'lat': 27.25346500, 'metadata': { 'name': '邵阳大汉通宝汽车销售服务有限公司', 'address': '湖南省邵阳市双清区宝庆东路169号大汉汽车城，422000', 'province': '湖南省', 'city': '邵阳市' } },
          { 'lng': 119.69728100, 'lat': 29.14741100, 'metadata': { 'name': '金华金昌宝顺汽车销售服务有限公司', 'address': '浙江省金华市金东区赤松镇金华汽车城3S-5号', 'province': '浙江省', 'city': '金华市' } },
          { 'lng': 116.52175065, 'lat': 39.91390864, 'metadata': { 'name': '北京市华德宝汽车销售服务有限公司', 'address': '北京市朝阳区建国路52号，邮编：100025', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 113.25548511, 'lat': 23.37482620, 'metadata': { 'name': '广州粤之宝汽车销售服务有限公司', 'address': '广州市花都区镜湖大道10号邮编：510800', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 120.66248000, 'lat': 27.99158400, 'metadata': { 'name': '温州市好达机电有限公司-鹿城分公司', 'address': '浙江省温州市鹿城区过境公路南端1号,325011', 'province': '浙江省', 'city': '温州市' } },
          { 'lng': 122.29736577, 'lat': 40.71143432, 'metadata': { 'name': '营口燕德宝汽车销售服务有限公司', 'address': '营口市站前区沈营公路1号邮编：115000', 'province': '辽宁省', 'city': '营口市' } },
          { 'lng': 121.60525019, 'lat': 29.83335847, 'metadata': { 'name': '宁波宝恒汽车集团有限公司', 'address': '浙江省宁波市鄞州区下应北路288号邮编315104', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 121.63633331, 'lat': 31.23008024, 'metadata': { 'name': '上海宝诚汽车销售服务有限公司', 'address': '上海浦东新区龙东大道2777号邮编201203', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 112.49494500, 'lat': 37.86091100, 'metadata': { 'name': '太原宝诚汽车销售服务有限公司', 'address': '山西省太原市万柏林区迎泽西大街清光巷8号邮编030024', 'province': '山西省', 'city': '太原市' } },
          { 'lng': 115.60470200, 'lat': 34.45333800, 'metadata': { 'name': '商丘商德宝汽车销售服务有限公司', 'address': '商丘市中原车城新兴路与车城大道交叉口西北角', 'province': '河南省', 'city': '商丘市' } },
          { 'lng': 108.39688157, 'lat': 22.82307100, 'metadata': { 'name': '南宁中达桂宝汽车服务有限公司云景分公司', 'address': '南宁市云景路11号', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 121.61831471, 'lat': 29.82118295, 'metadata': { 'name': '宁波宝恒汽车销售服务有限公司诚信路店', 'address': '浙江省宁波市鄞州区诚信路399号邮编：315104', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 117.18810700, 'lat': 34.27155300, 'metadata': { 'name': '徐州宝尊汽车销售服务有限公司', 'address': '江苏省徐州市两山口104国道南侧华山路,221000', 'province': '江苏省', 'city': '徐州市' } },
          { 'lng': 125.21115811, 'lat': 43.82578945, 'metadata': { 'name': '长春中顺宝汽车销售服务有限公司', 'address': '吉林省长春市汽车产业开发区长沈路4236号,130103', 'province': '吉林省', 'city': '长春市' } },
          { 'lng': 116.89347207, 'lat': 36.65510626, 'metadata': { 'name': '济南大友宝汽车销售服务有限公司', 'address': '山东省济南市经十西路368号，250117', 'province': '山东省', 'city': '济南市' } },
          { 'lng': 120.09626800, 'lat': 30.29352800, 'metadata': { 'name': '浙江金湖机电有限公司', 'address': '浙江省杭州市西湖区文一西路508号邮编310012', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 120.11153078, 'lat': 30.33046340, 'metadata': { 'name': '杭州宝荣汽车销售服务有限公司', 'address': '浙江省杭州市莫干山路1329号邮编310011', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 123.40261400, 'lat': 41.72920400, 'metadata': { 'name': '沈阳运通宸宝汽车销售服务有限公司', 'address': '辽宁省沈阳市浑南新区浑南西路157-1号,110000', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 84.90775683, 'lat': 45.56439291, 'metadata': { 'name': '克拉玛依燕宝汽车销售服务有限公司', 'address': '克拉玛依市西环路附2号邮编：834000', 'province': '新疆维吾尔自治区', 'city': '克拉玛依市' } },
          { 'lng': 117.43679488, 'lat': 34.83895224, 'metadata': { 'name': '枣庄宝景汽车销售服务有限公司', 'address': '枣庄市薛城区光明路张范段邮编277100', 'province': '山东省', 'city': '枣庄市' } },
          { 'lng': 115.60348600, 'lat': 35.27619500, 'metadata': { 'name': '菏泽乾宝汽车销售服务有限公司', 'address': '菏泽市黄河东路88号', 'province': '山东省', 'city': '菏泽市' } },
          { 'lng': 91.07609400, 'lat': 29.63192500, 'metadata': { 'name': '拉萨万宝行汽车销售服务有限公司', 'address': '拉萨市柳梧新区世纪大道邮编：850000', 'province': '西藏自治区', 'city': '拉萨市' } },
          { 'lng': 121.45479500, 'lat': 31.30754500, 'metadata': { 'name': '上海宝诚尊悦汽车销售服务有限公司', 'address': '上海市闸北区共和新路3550号200435', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 114.42007800, 'lat': 36.12236900, 'metadata': { 'name': '安阳安德宝汽车销售服务有限公司', 'address': '河南省安阳市人民大道与光明路交叉口向北200米路东,,455000', 'province': '河南省', 'city': '安阳市' } },
          { 'lng': 119.68700910, 'lat': 30.20552555, 'metadata': { 'name': '杭州金昌宝顺汽车销售服务有限公司', 'address': '浙江省临安市玲珑街道锦溪南路1008号', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 114.12621000, 'lat': 22.64818000, 'metadata': { 'name': '深圳南方宝诚汽车销售服务有限公司', 'address': '广东省深圳市龙岗区布吉中心区平吉大道与布澜路交汇处百分百创意广场首层，518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 115.11874100, 'lat': 35.75696900, 'metadata': { 'name': '濮阳悦宝行汽车销售服务有限公司', 'address': '河南省濮阳市106国道濮阳北高速口向南500米路东，457000', 'province': '河南省', 'city': '濮阳市' } },
          { 'lng': 120.37309562, 'lat': 28.14375277, 'metadata': { 'name': '丽水宝顺行汽车销售服务有限公司青田分公司', 'address': '浙江省青田县温溪镇沙埠村安特工业区研发楼第一层邮编:323900', 'province': '浙江省', 'city': '青田市' } },
          { 'lng': 119.05718200, 'lat': 25.47769500, 'metadata': { 'name': '莆田宝奇汽车销售服务有限公司', 'address': '福建省莆田市荔城区西天尾镇城涵西大道2068号（奇奇汽车城内）邮编：351100', 'province': '福建省', 'city': '莆田市' } },
          { 'lng': 118.15321900, 'lat': 39.78256400, 'metadata': { 'name': '唐山市浩丰宝汽车销售服务有限公司', 'address': '河北省唐山市丰润区曹信庄村村东,63000', 'province': '河北省', 'city': '唐山市' } },
          { 'lng': 115.87277900, 'lat': 32.84740900, 'metadata': { 'name': '阜阳众国宝祥汽车销售服务有限公司', 'address': '安徽省阜阳市经济开发区经七路377号,236000', 'province': '安徽省', 'city': '阜阳市' } },
          { 'lng': 104.91018800, 'lat': 26.54700600, 'metadata': { 'name': '六盘水宝翔行汽车销售服务有限公司', 'address': '贵州省六盘水市红桥新区奥特莱斯正对面，553000', 'province': '贵州省', 'city': '六盘水市' } },
          { 'lng': 104.07248400, 'lat': 30.76513700, 'metadata': { 'name': '成都新宝汽车销售服务有限公司', 'address': '四川省成都市新都区大丰镇大天路391号，610504', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 116.68009400, 'lat': 35.44323800, 'metadata': { 'name': '济宁天泽乾宝行汽车销售服务有限公司', 'address': '山东省济宁市高新区327国道与同济路交叉口南100米路东,272000', 'province': '山东省', 'city': '济宁市' } },
          { 'lng': 120.19639000, 'lat': 30.27954500, 'metadata': { 'name': '杭州元通之宝二手车销售服务有限公司', 'address': '浙江省杭州市江干区凯旋路441号,310020', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 117.27046187, 'lat': 38.99176247, 'metadata': { 'name': '天津市中顺津宝汽车服务有限公司', 'address': '天津市西青经济开发区赛达世纪大道6号，邮编：300385', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 110.31628753, 'lat': 25.36771827, 'metadata': { 'name': '桂林市粤宝汽车销售服务有限公司', 'address': '广西壮族自治区桂林八里七路大西南汽车城', 'province': '广西壮族自治区', 'city': '桂林市' } },
          { 'lng': 113.97625128, 'lat': 22.95266507, 'metadata': { 'name': '东莞宝信汽车销售服务有限公司', 'address': '广东省东莞市常平镇袁山贝思源路66-68号', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 120.05397200, 'lat': 29.37722000, 'metadata': { 'name': '义乌信通宝汽车销售服务有限公司', 'address': '浙江省义乌市后宅街道神舟路699号，322000', 'province': '浙江省', 'city': '义乌市' } },
          { 'lng': 106.57070700, 'lat': 29.69138100, 'metadata': { 'name': '重庆通源宝源汽车销售服务有限公司', 'address': '重庆北部新区云卉路11号，401122', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 110.15009500, 'lat': 22.66238400, 'metadata': { 'name': '玉林广之宝汽车销售服务有限公司', 'address': '广西壮族自治区玉林市玉州区二环路桂平路口西侧,537000', 'province': '广西壮族自治区', 'city': '玉林市' } },
          { 'lng': 116.26667800, 'lat': 39.95160100, 'metadata': { 'name': '北京卡森汽车服务有限公司', 'address': '北京市海淀区杏石口路16号', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 120.00753200, 'lat': 28.92162400, 'metadata': { 'name': '永康泓宝行汽车销售服务有限公司', 'address': '浙江省永康市烈桥七里经堂康庄路3号,321300', 'province': '浙江省', 'city': '永康市' } },
          { 'lng': 112.51453500, 'lat': 34.68423800, 'metadata': { 'name': '洛阳中升汇宝汽车销售服务有限公司', 'address': '河南省洛阳市瀍河区名车苑启明南路东延长线,471000', 'province': '河南省', 'city': '洛阳市' } },
          { 'lng': 112.04100100, 'lat': 21.89034500, 'metadata': { 'name': '阳江美宝行汽车销售服务有限公司', 'address': '广东省阳江市阳东区东城镇裕东一路67号,529900', 'province': '广东省', 'city': '阳江市' } },
          { 'lng': 119.14675129, 'lat': 36.64630681, 'metadata': { 'name': '潍坊广宝汽车销售服务有限公司', 'address': '山东省潍坊市奎文区潍州路369号邮编261051', 'province': '山东省', 'city': '潍坊市' } },
          { 'lng': 126.56135300, 'lat': 45.81905700, 'metadata': { 'name': '哈尔滨龙宝汽车销售服务有限公司', 'address': '黑龙江省哈尔滨市松北区中源大道9656号,邮编150027', 'province': '黑龙江省', 'city': '哈尔滨市' } },
          { 'lng': 120.43581900, 'lat': 31.88461300, 'metadata': { 'name': '江阴宝诚汽车销售服务有限公司第二分公司', 'address': '江苏省江阴市周庄镇砂山大道288号,214400', 'province': '江苏省', 'city': '江阴市' } },
          { 'lng': 103.92925200, 'lat': 30.68088600, 'metadata': { 'name': '成都运通锐宝汽车销售服务有限公司', 'address': '成都市青羊区光润一路78号10栋1层,610000', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 113.61363400, 'lat': 23.12700900, 'metadata': { 'name': '广州美宝行汽车销售服务有限公司新塘分公司', 'address': '广州市增城区新塘镇广深大道中153号太阳城娱乐广场一楼西侧101房,511300', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 114.05821744, 'lat': 22.63600691, 'metadata': { 'name': '深圳中升汇宝汽车销售服务有限公司', 'address': '深圳市龙华新区龙华办事处油松社区中裕冠大道1号1014号邮编：518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 104.12141300, 'lat': 30.48412800, 'metadata': { 'name': '成都蓉孚宝汽车销售服务有限公司', 'address': '四川省成都市天府新区万安街道场镇社区中太路1号,610213', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 117.18064800, 'lat': 39.12921700, 'metadata': { 'name': '天津运通隆宝汽车销售服务有限公司', 'address': '天津市南开区长江道与南京路交口融汇广场351号', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 80.25359400, 'lat': 41.22821000, 'metadata': { 'name': '阿克苏燕德宝汽车销售服务有限公司', 'address': '新疆省阿克苏市温宿县阿温大道大欣汽车城内A2-2,843100', 'province': '新疆维吾尔自治区', 'city': '阿克苏市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '湘西宝利汽车服务有限公司', 'address': '湖南省吉首市湘西经济开发区武陵山大道（湘西职院对面），416000', 'province': '湖南省', 'city': '吉首市' } },
          { 'lng': 113.07507200, 'lat': 23.04511400, 'metadata': { 'name': '佛山鼎宝行汽车销售服务有限公司', 'address': '佛山市禅城区兴业路49号,528051', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 113.29477900, 'lat': 22.77893000, 'metadata': { 'name': '佛山宝运行汽车销售服务有限公司', 'address': '佛山市顺德区容桂街道江南大道39号528303', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 102.73622400, 'lat': 25.08535700, 'metadata': { 'name': '昆明宝创汽车销售服务有限公司', 'address': '云南省昆明市北京路1048号,邮编650000', 'province': '云南省', 'city': '昆明市' } },
          { 'lng': 113.96094200, 'lat': 30.93603900, 'metadata': { 'name': '孝感恒信宝汽车销售服务有限公司', 'address': '湖北省孝感市孝南区孝汉大道8号，432000', 'province': '湖北省', 'city': '孝感市' } },
          { 'lng': 113.84042900, 'lat': 22.70972400, 'metadata': { 'name': '深圳华顺宝汽车销售服务有限公司', 'address': '广东省深圳市宝安区福永街道新田工业厂房A栋首层101号518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '东莞庆宝汽车服务有限公司', 'address': '东莞市长安镇涌头社区德政东路127号B栋一楼,523850', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 118.90363009, 'lat': 32.11695114, 'metadata': { 'name': '南京宝利丰汽车销售服务有限公司', 'address': '南京市栖霞区尧化街道尧胜社区马家园106号邮编：210046', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 120.62390032, 'lat': 30.08463494, 'metadata': { 'name': '绍兴宝顺汽车销售服务有限公司', 'address': '浙江省绍兴市袍江新区中心大道康宁路口205号，312071', 'province': '浙江省', 'city': '绍兴市' } },
          { 'lng': 119.97874600, 'lat': 30.27785000, 'metadata': { 'name': '杭州金昌至宝二手车销售服务有限公司', 'address': '浙江省杭州市文一西路1802号,311121', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 119.49452000, 'lat': 39.92334900, 'metadata': { 'name': '秦皇岛威宝汽车销售服务有限公司', 'address': '河北省秦皇岛市秦皇西大街291号,066004', 'province': '河北省', 'city': '秦皇岛市' } },
          { 'lng': 120.66378800, 'lat': 28.04300100, 'metadata': { 'name': '永嘉宝诚汽车销售服务有限公司', 'address': '浙江省永嘉县江北街道新104国道客运北站旁，325102', 'province': '浙江省', 'city': '永嘉市' } },
          { 'lng': 106.72771437, 'lat': 26.58148539, 'metadata': { 'name': '贵阳宝源汽车销售服务有限公司-市东路展厅', 'address': '贵州省贵阳市贵阳东路33号邮编：550002', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 113.94557600, 'lat': 22.54618600, 'metadata': { 'name': '深圳市宝创汽车贸易有限公司', 'address': '广东省深圳市南山区深南大道麻雀岭工业区1栋,邮编518057', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 124.07155915, 'lat': 47.34889644, 'metadata': { 'name': '齐齐哈尔中顺宝汽车销售服务有限公司', 'address': '齐齐哈尔市铁峰区联通大道297-1号邮编：161002', 'province': '黑龙江省', 'city': '齐齐哈尔市' } },
          { 'lng': 102.68526518, 'lat': 25.00355004, 'metadata': { 'name': '昆明宝远汽车销售服务有限公司', 'address': '云南省昆明市广福路217号邮编：650228', 'province': '云南省', 'city': '昆明市' } },
          { 'lng': 120.23117100, 'lat': 33.37533600, 'metadata': { 'name': '盐城宝诚汽车销售服务有限公司', 'address': '盐城市经济技术开发区泰山南路11号', 'province': '江苏省', 'city': '盐城市' } },
          { 'lng': 120.63282664, 'lat': 31.41712937, 'metadata': { 'name': '苏州骏宝行汽车销售服务有限公司', 'address': '江苏省苏州市相城区元和街道太阳路2700号，邮编：215133', 'province': '江苏省', 'city': '苏州市' } },
          { 'lng': 120.54550643, 'lat': 31.26583078, 'metadata': { 'name': '苏州信宝行汽车销售服务有限公司', 'address': '江苏苏州市木渎珠江南路999号邮政编码：215000', 'province': '江苏省', 'city': '苏州市' } },
          { 'lng': 113.11088287, 'lat': 23.00852688, 'metadata': { 'name': '佛山市珅宝汽车销售服务有限公司', 'address': '广东省佛山市南海区桂城桂江立交海八路东南侧62街邮编528000', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 109.05681149, 'lat': 34.26722950, 'metadata': { 'name': '西安中升之宝汽车销售服务有限公司', 'address': '陕西省西安市霸桥区东三环穆将王立交东辅道邮编：710038', 'province': '陕西省', 'city': '西安市' } },
          { 'lng': 113.68909188, 'lat': 34.85912926, 'metadata': { 'name': '郑州郑德宝汽车销售服务有限公司', 'address': '河南省郑州市花园北路与连霍高速交汇处向北500米邮编：450000', 'province': '河南省', 'city': '郑州市' } },
          { 'lng': 112.68315500, 'lat': 37.74617900, 'metadata': { 'name': '晋中驰宝汽车销售服务有限公司', 'address': '山西省晋中市汇通路鸣李段030600', 'province': '山西省', 'city': '晋中市' } },
          { 'lng': 123.46778460, 'lat': 41.73044625, 'metadata': { 'name': '沈阳华宝汽车销售服务有限公司', 'address': '辽宁省沈阳市浑南新区涌泉路1号邮编110168', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 106.46790062, 'lat': 29.51868009, 'metadata': { 'name': '重庆宝盛汽车销售服务有限公司', 'address': '重庆市九龙坡区二郎科技新城迎宾大道20号邮编400039', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 121.30001273, 'lat': 30.18075009, 'metadata': { 'name': '慈溪宝利丰汽车销售服务有限公司', 'address': '浙江省慈溪市开发大道2509号邮编：315325', 'province': '浙江省', 'city': '慈溪市' } },
          { 'lng': 113.71786300, 'lat': 22.82142800, 'metadata': { 'name': '东莞市庆丰宝昌汽车销售服务有限公司', 'address': '广东省东莞市虎门镇大宁村麒麟西路', 'province': '广东省', 'city': '东莞市' } },
          { 'lng': 120.42292376, 'lat': 36.10011014, 'metadata': { 'name': '青岛信宝行汽车销售服务有限公司', 'address': '山东省青岛市市北区银川西路148号邮编266035', 'province': '山东省', 'city': '青岛市' } },
          { 'lng': 114.28642497, 'lat': 30.63657513, 'metadata': { 'name': '武汉宝泽汽车销售服务有限公司', 'address': '湖北省武汉市江岸区黄浦科技园特6号邮编430017', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 102.70274014, 'lat': 25.02676450, 'metadata': { 'name': '云南德凯宝马汽车技术服务有限公司', 'address': '云南省昆明市经开区顺通大道国际汽车城C-05', 'province': '云南省', 'city': '昆明市' } },
          { 'lng': 120.91528469, 'lat': 32.00878241, 'metadata': { 'name': '南通宝诚汽车销售服务有限公司', 'address': '南通市青年中路159号（车管所旁）邮编226007', 'province': '江苏省', 'city': '南通市' } },
          { 'lng': 121.43205681, 'lat': 28.64410818, 'metadata': { 'name': '台州宝诚汽车销售服务有限公司', 'address': '浙江省台州市椒江区东环大道707号邮编：318000', 'province': '浙江省', 'city': '台州市' } },
          { 'lng': 104.71562400, 'lat': 29.33210900, 'metadata': { 'name': '自贡长宝汽车销售服务有限公司', 'address': '四川省自贡市贡井区南环路工业集中园区643020', 'province': '四川省', 'city': '自贡市' } },
          { 'lng': 121.89972300, 'lat': 29.42120200, 'metadata': { 'name': '象山泓宝行汽车销售服务有限公司', 'address': '浙江省象山县滨海大道18号邮政编码：315712', 'province': '浙江省', 'city': '象山市' } },
          { 'lng': 104.39269900, 'lat': 31.06883500, 'metadata': { 'name': '德阳长宝汽车销售服务有限公司', 'address': '四川省德阳市泰山南路与朝江路交汇处（新汽车南站旁）邮政编码：618000', 'province': '四川省', 'city': '德阳市' } },
          { 'lng': 117.27392100, 'lat': 31.78972800, 'metadata': { 'name': '合肥市宝之佳汽车销售服务有限公司', 'address': '安徽省合肥市经济技术开发区繁华大道18号', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 121.26819117, 'lat': 28.65583893, 'metadata': { 'name': '台州宝驿汽车销售服务有限公司', 'address': '浙江省台州市黄岩区北城街道二环北路168号邮政编码：318020', 'province': '浙江省', 'city': '台州市' } },
          { 'lng': 120.78183600, 'lat': 40.73987500, 'metadata': { 'name': '葫芦岛华宝汽车销售服务有限公司', 'address': '葫芦岛高新技术产业园区高铁连接线东侧、北二路北侧西，125000', 'province': '辽宁省', 'city': '葫芦岛市' } },
          { 'lng': 108.89359613, 'lat': 34.22525427, 'metadata': { 'name': '西安金花宝鼎汽车销售服务有限公司', 'address': '陕西省西安市高新区科技四路190号,710075', 'province': '陕西省', 'city': '西安市' } },
          { 'lng': 120.20675100, 'lat': 29.29502000, 'metadata': { 'name': '东阳市宝利丰汽车销售服务有限公司', 'address': '东阳市世贸大道75号', 'province': '浙江省', 'city': '东阳市' } },
          { 'lng': 114.91543100, 'lat': 40.76124800, 'metadata': { 'name': '张家口轩之宝汽车销售服务有限公司', 'address': '河北省张家口市高新区张宣公路西侧075000', 'province': '河北省', 'city': '张家口市' } },
          { 'lng': 115.54012546, 'lat': 38.89501352, 'metadata': { 'name': '保定东澜誉宝汽车销售服务有限公司', 'address': '河北省保定市复兴东路1989号邮政编码：071000', 'province': '河北省', 'city': '保定市' } },
          { 'lng': 121.59985769, 'lat': 38.89115882, 'metadata': { 'name': '大连中升之宝汽车销售服务有限公司', 'address': '辽宁省大连市沙河口区星海广场F区26号邮编116021', 'province': '辽宁省', 'city': '大连市' } },
          { 'lng': 104.11790803, 'lat': 30.59992286, 'metadata': { 'name': '成都锦泰宝驹汽车销售服务有限公司', 'address': '四川省成都市锦江区南三环路二段485号邮编610066', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 116.51155732, 'lat': 39.80788914, 'metadata': { 'name': '北京燕德宝汽车销售有限公司', 'address': '北京经济技术开发区宏达北路26号邮编100176', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 121.61158900, 'lat': 39.01780400, 'metadata': { 'name': '大连燕德宝汽车销售有限公司', 'address': '辽宁省大连市甘井子区华北路699号邮编116031', 'province': '辽宁省', 'city': '大连市' } },
          { 'lng': 121.56325538, 'lat': 31.18400369, 'metadata': { 'name': '上海凡德汽车销售服务有限公司', 'address': '上海浦东新区沪南路2525号邮编201315', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 129.58241000, 'lat': 42.90431000, 'metadata': { 'name': '延吉中顺宝汽车销售服务有限公司', 'address': '吉林省延吉市长白山东路3665号1001', 'province': '吉林省', 'city': '延吉市' } },
          { 'lng': 113.31651200, 'lat': 23.14384500, 'metadata': { 'name': '广东粤宝汽车销售服务有限公司-第二分公司', 'address': '广东省广州市越秀区水荫路54号，510075', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 118.22675300, 'lat': 33.93743500, 'metadata': { 'name': '宿迁宝尊汽车销售服务有限公司', 'address': '宿迁苏宿园区国际名车广场邮政编码：223800', 'province': '江苏省', 'city': '宿迁市' } },
          { 'lng': 116.62790900, 'lat': 31.76568100, 'metadata': { 'name': '六安宝源汽车销售服务有限公司', 'address': '安徽省六安市东方汽车城大华山路与凤凰南路交叉口,邮编：237000', 'province': '安徽省', 'city': '六安市' } },
          { 'lng': 116.54590746, 'lat': 39.93513437, 'metadata': { 'name': '北京星德宝汽车销售服务有限公司', 'address': '北京市朝阳区高碑店乡白家楼8号邮编100024', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 121.73903400, 'lat': 29.95406000, 'metadata': { 'name': '宁波轿辰宝晨汽车销售服务有限公司', 'address': '浙江省宁波市北仑区小港街道江南东路177-2号，315000', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 117.16146920, 'lat': 36.69506777, 'metadata': { 'name': '济南宝悦行汽车销售服务有限公司', 'address': '济南市历下区世纪大道13966号,250000', 'province': '山东省', 'city': '济南市' } },
          { 'lng': 123.31164141, 'lat': 41.80645203, 'metadata': { 'name': '沈阳业乔信宝汽车销售服务有限公司', 'address': '辽宁省沈阳市于洪区沈大路28号邮编：110141', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 114.00798700, 'lat': 35.30256100, 'metadata': { 'name': '新乡和德宝汽车销售服务有限公司', 'address': '新乡市金穗大道与京港澳高速交叉口向东2000米路北', 'province': '河南省', 'city': '新乡市' } },
          { 'lng': 112.17468000, 'lat': 32.09111900, 'metadata': { 'name': '襄阳恒信宝汽车销售服务有限公司', 'address': '湖北省襄阳市襄州区春园东路189号，441000', 'province': '湖北省', 'city': '襄阳市' } },
          { 'lng': 116.75254300, 'lat': 23.40005700, 'metadata': { 'name': '汕头市宝悦德宏汽车服务有限公司泰山路分公司', 'address': '广东省汕头市龙湖区泰山路116号1楼，515041', 'province': '广东省', 'city': '汕头市' } },
          { 'lng': 103.80978100, 'lat': 25.47184900, 'metadata': { 'name': '曲靖宝凯汽车销售服务有限公司', 'address': '曲靖市麒麟区子午路麒麟中央商务区,邮编：655000', 'province': '云南省', 'city': '曲靖市' } },
          { 'lng': 109.81598200, 'lat': 40.59648500, 'metadata': { 'name': '包头宝泽行汽车维修服务有限公司', 'address': '内蒙古包头市希望工业园区白云路东侧，南绕城北侧014030', 'province': '内蒙古自治区', 'city': '包头市' } },
          { 'lng': 104.16862000, 'lat': 30.78251300, 'metadata': { 'name': '成都宝源汽车销售服务有限公司', 'address': '四川省成都市新都区蜀龙大道五龙山路189号，610500', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 121.36452800, 'lat': 30.78718600, 'metadata': { 'name': '上海景宝汽车服务有限公司', 'address': '上海市金山区亭卫公路2285号1幢', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 125.38621600, 'lat': 43.76049600, 'metadata': { 'name': '长春通立冠宝汽车销售服务有限公司', 'address': '吉林省长春市净月高新技术产业开发区生态大街7566号', 'province': '吉林省', 'city': '长春市' } },
          { 'lng': 107.63189100, 'lat': 35.75431400, 'metadata': { 'name': '庆阳金汇宝汽车销售服务有限公司', 'address': '甘肃省庆阳市西峰区庆华大道北段，745000', 'province': '甘肃省', 'city': '庆阳市' } },
          { 'lng': 120.06848600, 'lat': 30.55164700, 'metadata': { 'name': '湖州康桥宝盈汽车销售服务有限公司', 'address': '浙江省湖州市德清县德清大道金鹅山小区西北200米，313216', 'province': '浙江省', 'city': '湖州市' } },
          { 'lng': 119.35782001, 'lat': 26.02154018, 'metadata': { 'name': '福州中宝汽车销售服务有限公司', 'address': '福建省福州市仓山区科技园6区168号，350007', 'province': '福建省', 'city': '福州市' } },
          { 'lng': 119.60219656, 'lat': 31.73708096, 'metadata': { 'name': '常州金坛宝尊汽车销售服务有限公司', 'address': '江苏省常州市金坛区南环二路225号,213200', 'province': '江苏省', 'city': '常州市' } },
          { 'lng': 116.35946700, 'lat': 39.99334000, 'metadata': { 'name': '北京京宝行汽车服务有限公司', 'address': '北京市海淀区学院路34号院1号楼A-1，100110', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 103.72455761, 'lat': 29.59397196, 'metadata': { 'name': '乐山长宝汽车销售服务有限公司', 'address': '四川省乐山市中区长青路999号邮编：614000', 'province': '四川省', 'city': '乐山市' } },
          { 'lng': 120.49458700, 'lat': 36.15288000, 'metadata': { 'name': '青岛万宝行汽车销售服务有限公司', 'address': '青岛市崂山区中韩街道办事处枯桃社区,266000', 'province': '山东省', 'city': '青岛市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '北京市顺宝行汽车销售服务有限公司', 'address': '北京市朝阳区王四营乡马房寺398号', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 113.33527300, 'lat': 23.21405200, 'metadata': { 'name': '广东南方宝诚汽车销售服务有限公司', 'address': '广东省广州市白云区同和路331号', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 116.48869200, 'lat': 23.52005700, 'metadata': { 'name': '揭阳宝泰行汽车销售服务有限公司', 'address': '广东省揭阳市砲台镇东沟村厝潮头206国道与机场路交界处，515500', 'province': '广东省', 'city': '揭阳市' } },
          { 'lng': 121.30174600, 'lat': 31.35733500, 'metadata': { 'name': '上海众嘉宝泓汽车服务有限公司', 'address': '上海市嘉定区澄浏中路886号，201801', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 116.85268900, 'lat': 33.89205000, 'metadata': { 'name': '淮北美宝行汽车销售服务有限公司', 'address': '安徽省淮北市烈山区淮北国购汽车文化园3号楼，235000', 'province': '安徽省', 'city': '淮北市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '南京宁宝汽车服务有限公司-鼓楼销售分公司', 'address': '江苏省南京市鼓楼区汉中门大街309号', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '宁波轿辰宝晨汽车销售服务有限公司北仑分公司', 'address': '浙江省宁波市北仑区泰山路389号银泰城二期8号门', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 120.38436039, 'lat': 31.58777730, 'metadata': { 'name': '无锡宝尊汽车销售服务有限公司', 'address': '江苏省无锡市锡山区东亭庄桥路16号邮编：214101', 'province': '江苏省', 'city': '无锡市' } },
          { 'lng': 118.49084776, 'lat': 37.43557083, 'metadata': { 'name': '东营宜宝轩汽车销售服务有限公司', 'address': '山东省东营市东营区西四路914号邮编：257069', 'province': '山东省', 'city': '东营市' } },
          { 'lng': 121.09575860, 'lat': 31.48296590, 'metadata': { 'name': '太仓宝诚汽车销售服务有限公司', 'address': '江苏省苏州市太仓市太仓经济开发区北京西路8号邮编：215400', 'province': '江苏省', 'city': '太仓市' } },
          { 'lng': 104.16798119, 'lat': 30.69286503, 'metadata': { 'name': '成都长征长宝汽车销售服务有限公司', 'address': '四川省成都市成华区东三环路二段龙潭工业园航天路2号邮政编码：610052', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 109.55702200, 'lat': 36.67796100, 'metadata': { 'name': '延安金华宝汽车销售服务有限公司', 'address': '陕西省延安市宝塔区李渠镇碾庄沟杨兴庄汽车城8号', 'province': '陕西省', 'city': '延安市' } },
          { 'lng': 118.11074800, 'lat': 24.49232400, 'metadata': { 'name': '厦门中宝汽车有限公司快速服务分公司', 'address': '厦门市思明区湖滨东路307号', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 106.53695900, 'lat': 29.51693400, 'metadata': { 'name': '重庆中升之宝汽车销售服务有限公司', 'address': '重庆市九龙坡区九滨路1号邮编：400050', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 117.74816130, 'lat': 24.49900210, 'metadata': { 'name': '漳州市中宝汽车销售有限公司', 'address': '福建省漳州市龙文区龙文北路123号邮政编码：363005', 'province': '福建省', 'city': '漳州市' } },
          { 'lng': 123.39598889, 'lat': 41.80748304, 'metadata': { 'name': '沈阳宝绅汽车维修服务有限公司', 'address': '辽宁省沈阳市大东区东陵西路4号,110043', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 119.39178600, 'lat': 32.45361200, 'metadata': { 'name': '扬州信宝行汽车销售服务有限公司', 'address': '江苏省扬州市扬子江北路国际汽车城入口处，邮政编码：225000', 'province': '江苏省', 'city': '扬州市' } },
          { 'lng': 119.67541400, 'lat': 29.07788500, 'metadata': { 'name': '金华骏宝行汽车销售服务有限公司', 'address': '浙江省金华市婺城区环城南路西段333号邮编321013', 'province': '浙江省', 'city': '金华市' } },
          { 'lng': 111.38639500, 'lat': 30.66508400, 'metadata': { 'name': '宜昌宝泽汽车销售服务有限公司', 'address': '湖北省宜昌市伍家岗区东站路168号', 'province': '湖北省', 'city': '宜昌市' } },
          { 'lng': 120.96617882, 'lat': 31.92782398, 'metadata': { 'name': '南通润宝行汽车销售服务有限公司', 'address': '南通市经济技术开发区星湖大道1055号', 'province': '江苏省', 'city': '南通市' } },
          { 'lng': 122.97167699, 'lat': 41.13017091, 'metadata': { 'name': '鞍山华宝汽车销售服务有限公司', 'address': '辽宁省鞍山市千山区西环路106号邮政编码：114016', 'province': '辽宁省', 'city': '鞍山市' } },
          { 'lng': 118.73542900, 'lat': 32.04442500, 'metadata': { 'name': '南京宁宝汽车服务有限公司-鼓楼分公司', 'address': '南京市鼓楼区汉中门大街309号，210000', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 116.53832811, 'lat': 35.37976184, 'metadata': { 'name': '济宁中达任宝汽车销售服务有限公司', 'address': '山东省济宁经济开发区美恒汽博城1号邮编：272000', 'province': '山东省', 'city': '济宁市' } },
          { 'lng': 121.01500800, 'lat': 31.42163600, 'metadata': { 'name': '昆山宝诚汽车销售服务有限公司', 'address': '昆山周市鎮黄浦江北路208号', 'province': '江苏省', 'city': '昆山市' } },
          { 'lng': 117.31103376, 'lat': 31.79634915, 'metadata': { 'name': '合肥宝利丰二手车销售服务中心有限公司', 'address': '安徽省合肥市包河区机场路9号邮编:230051', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 113.41293468, 'lat': 23.13947985, 'metadata': { 'name': '广州宝悦汽车贸易有限公司第一分公司', 'address': '广东省广州市天河区大观南路57号邮编510660', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 121.46801413, 'lat': 31.34570579, 'metadata': { 'name': '上海宝诚中环汽车销售服务有限公司', 'address': '上海市宝山区长江西路999号，200431', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 110.00820800, 'lat': 27.52361000, 'metadata': { 'name': '怀化宝利汽车销售服务有限公司', 'address': '湖南省怀化市凉山路与锦溪南路交叉点418000', 'province': '湖南省', 'city': '怀化市' } },
          { 'lng': 113.17947500, 'lat': 29.42884500, 'metadata': { 'name': '岳阳市美宝行汽车销售服务有限公司', 'address': '湖南省岳阳市城陵矶临港产业新区联港路，414200', 'province': '湖南省', 'city': '岳阳市' } },
          { 'lng': 108.43118700, 'lat': 22.81566600, 'metadata': { 'name': '南宁中达桂宝汽车服务有限公司-琅东分公司', 'address': '广西壮族自治区南宁市仙葫大道18号，530022', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 112.03714300, 'lat': 27.77010000, 'metadata': { 'name': '娄底力天宝崐汽车销售服务有限公司', 'address': '湖南省娄底市经济开发区娄涟公路南侧三一重工东500米邮编:417000', 'province': '湖南省', 'city': '娄底市' } },
          { 'lng': 120.96192093, 'lat': 31.93826393, 'metadata': { 'name': '海门宝致行汽车销售服务有限公司', 'address': '江苏省海门市长通路9号', 'province': '江苏省', 'city': '海门市' } },
          { 'lng': 121.57199100, 'lat': 31.25988400, 'metadata': { 'name': '上海上德宝骏汽车销售服务有限公司', 'address': '上海市浦东新区居家桥路571号', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 103.86808159, 'lat': 36.08539304, 'metadata': { 'name': '兰州金瑞宝汽车销售服务有限公司-二手车展厅', 'address': '甘肃省兰州市城关区盐场路红柳滩2号，730046', 'province': '甘肃省', 'city': '兰州市' } },
          { 'lng': 121.52535800, 'lat': 29.93352400, 'metadata': { 'name': '宁波市宝昌汽车销售服务有限公司', 'address': '浙江省宁波市江北区江北大道389号', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 106.17618650, 'lat': 30.77444173, 'metadata': { 'name': '南充宝源汽车销售服务有限公司', 'address': '四川省南充市高坪区航空港工业集中区东顺路邮编:637000', 'province': '四川省', 'city': '南充市' } },
          { 'lng': 102.54731333, 'lat': 24.37518281, 'metadata': { 'name': '玉溪宝远汽车销售服务有限公司', 'address': '中国云南玉溪市太极路中段（玉溪一中往北600米）邮政编码：653100', 'province': '云南省', 'city': '玉溪市' } },
          { 'lng': 118.13780467, 'lat': 24.52735441, 'metadata': { 'name': '厦门信达通宝汽车销售服务有限公司', 'address': '厦门市湖里区枋钟路机场候机楼广场西南侧邮编：361009', 'province': '福建省', 'city': '厦门市' } },
          { 'lng': 103.37496512, 'lat': 23.37563470, 'metadata': { 'name': '红河中顺宝汽车销售服务有限公司', 'address': '云南省蒙自市工业园区护国路邮编：661100', 'province': '云南省', 'city': '红河市' } },
          { 'lng': 120.14321800, 'lat': 33.33315200, 'metadata': { 'name': '盐城宝景汽车销售服务有限公司', 'address': '江苏省盐城市盐都区新区新华路8号', 'province': '江苏省', 'city': '盐城市' } },
          { 'lng': 106.75127600, 'lat': 26.40830500, 'metadata': { 'name': '贵阳宝翔行汽车销售服务有限公司', 'address': '贵州省贵阳市花溪区孟关汽贸城邮政编码：550026', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 106.65204000, 'lat': 29.49735200, 'metadata': { 'name': '重庆市庆德宝汽车销售服务有限公司', 'address': '重庆市南岸区茶园新区通江大道121号，401336', 'province': '重庆市', 'city': '重庆市' } },
          { 'lng': 102.64956600, 'lat': 25.06075800, 'metadata': { 'name': '昆明宝瀚汽车销售服务有限公司', 'address': '云南省昆明市五华区滇缅大道2626号,650108', 'province': '云南省', 'city': '昆明市' } },
          { 'lng': 121.54616500, 'lat': 31.28344600, 'metadata': { 'name': '上海绿地宝仕汽车销售服务有限公司', 'address': '上海市杨浦区周家嘴路3388号', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 121.35042609, 'lat': 37.58570155, 'metadata': { 'name': '烟台宝信汽车销售服务有限公司', 'address': '山东省烟台市芝罘区幸福北路72号,264013', 'province': '山东省', 'city': '烟台市' } },
          { 'lng': 121.60679300, 'lat': 41.99225100, 'metadata': { 'name': '阜新汇丰宝汽车销售服务有限公司', 'address': '辽宁省阜新市经济开发区海清路北、新美街西，123001', 'province': '辽宁省', 'city': '阜新市' } },
          { 'lng': 116.99921900, 'lat': 32.57232000, 'metadata': { 'name': '淮南宝之佳汽车销售服务有限公司', 'address': '安徽省淮南市高新技术产业开发区春华街与国槐路交叉口，232000', 'province': '安徽省', 'city': '淮南市' } },
          { 'lng': 114.21415555, 'lat': 32.13474877, 'metadata': { 'name': '信阳宝莲常汽车销售服务有限公司', 'address': '河南省信阳市南京大道与京港澳高速交汇处向西200米,464000', 'province': '河南省', 'city': '信阳市' } },
          { 'lng': 114.98785300, 'lat': 30.45168600, 'metadata': { 'name': '黄冈宝鑫行汽车销售服务有限公司', 'address': '湖北省黄冈市黄州区南湖路南湖收费站出口500米处，438000', 'province': '湖北省', 'city': '黄冈市' } },
          { 'lng': 115.73385300, 'lat': 28.62944800, 'metadata': { 'name': '南昌宝顺行汽车销售服务有限公司', 'address': '江西省南昌市望城新区新兴西大道198号,330103', 'province': '江西省', 'city': '南昌市' } },
          { 'lng': 117.30770700, 'lat': 31.91123200, 'metadata': { 'name': '合肥宝泓汽车销售服务有限公司', 'address': '合肥市新站区物流大道与淮南路交叉口,230000', 'province': '安徽省', 'city': '合肥市' } },
          { 'lng': 114.04002800, 'lat': 22.54708500, 'metadata': { 'name': '深圳通源宝源二手车中心有限公司', 'address': '广东省深圳市福田区香蜜湖联合华鹏汽车广场A3，518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 106.75206400, 'lat': 26.62673000, 'metadata': { 'name': '贵阳宝源汽车销售服务有限公司乌当分公司', 'address': '贵州省贵阳市乌当区新添大道北段2号，550002', 'province': '贵州省', 'city': '贵阳市' } },
          { 'lng': 123.36739800, 'lat': 41.81932300, 'metadata': { 'name': '沈阳汇中宝二手车销售服务有限公司', 'address': '辽宁省沈阳市铁西区北二中路18甲-2号', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 114.39242400, 'lat': 27.88453400, 'metadata': { 'name': '宜春宝泽汽车销售服务有限公司', 'address': '江西省宜春市宜春市经济开发区320国道以西', 'province': '江西省', 'city': '宜春市' } },
          { 'lng': 87.44928600, 'lat': 43.92157600, 'metadata': { 'name': '乌鲁木齐汇顺宝汽车销售服务有限公司', 'address': '新疆维吾尔自治区乌鲁木齐新市区乌昌路2094号', 'province': '新疆维吾尔自治区', 'city': '乌鲁木齐市' } },
          { 'lng': 112.40129900, 'lat': 28.51319300, 'metadata': { 'name': '益阳力天宝崐汽车销售服务有限公司', 'address': '湖南省益阳市益阳市高新区银城大道湘北汽车物流园（赫山区）', 'province': '湖南省', 'city': '益阳市' } },
          { 'lng': 113.72641000, 'lat': 34.59472800, 'metadata': { 'name': '新郑市中升汇宝汽车销售服务有限公司', 'address': '新郑市龙湖镇郑新快速路与泰山路交叉口，451100', 'province': '河南省', 'city': '新郑市' } },
          { 'lng': 114.46873841, 'lat': 23.19091803, 'metadata': { 'name': '惠州市合宝汽车销售服务有限公司', 'address': '广东省惠州市惠城区汝湖镇先科大道汝湖6号区邮编516027', 'province': '广东省', 'city': '惠州市' } },
          { 'lng': 120.57412046, 'lat': 31.84489747, 'metadata': { 'name': '张家港宝景汽车销售服务有限公司', 'address': '张家港市经济开发区东南大道28号邮编:215617', 'province': '江苏省', 'city': '张家港市' } },
          { 'lng': 117.37595949, 'lat': 39.16697040, 'metadata': { 'name': '天津天宝汽车销售服务有限公司', 'address': '天津市东丽区天津空港经济区环河北路70号，300308', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 113.33221080, 'lat': 22.57961843, 'metadata': { 'name': '中山市宝星汽车销售服务有限公司', 'address': '广东省中山市西区彩虹大道163号邮编528411', 'province': '广东省', 'city': '中山市' } },
          { 'lng': 119.49407000, 'lat': 39.92301900, 'metadata': { 'name': '秦皇岛腾宝汽车维修服务有限公司', 'address': '河北省秦皇岛市东港路299-4号,066000', 'province': '河北省', 'city': '秦皇岛市' } },
          { 'lng': 117.16066315, 'lat': 39.23957126, 'metadata': { 'name': '天津市浩之宝二手车中心有限公司', 'address': '天津市北辰区北辰道2号', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 114.15330900, 'lat': 22.55846100, 'metadata': { 'name': '深圳宝泰行汽车销售服务有限公司', 'address': '深圳市罗湖区黄贝街道罗沙路5073号,518002', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 121.32717531, 'lat': 31.18037528, 'metadata': { 'name': '上海德宝汽车服务有限公司', 'address': '上海市闵行区华漕镇华翔路245号邮编201105', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 115.01621000, 'lat': 27.09845000, 'metadata': { 'name': '抚州市宝晋汽车销售服务有限公司-吉安分公司', 'address': '江西省吉安市青原区青原大道盛唐华都小区1栋102B商铺,343000', 'province': '江西省', 'city': '吉安市' } },
          { 'lng': 113.49670600, 'lat': 22.30128100, 'metadata': { 'name': '珠海锦泰宝汇汽车销售服务有限公司', 'address': '广东省珠海市香洲区华宇路323号1栋一层,519075', 'province': '广东省', 'city': '珠海市' } },
          { 'lng': 113.89739600, 'lat': 22.59573400, 'metadata': { 'name': '深圳市宝创汽车贸易有限公司宝安分公司', 'address': '深圳市宝安区西乡大道与锦花路交汇处正泰商业大厦一楼', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 121.17807700, 'lat': 31.29025000, 'metadata': { 'name': '上海祺宝汽车销售服务有限公司', 'address': '上海市安亭镇安驰路666号，201805', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 115.93226800, 'lat': 28.69662300, 'metadata': { 'name': '南昌万宝行销售服务有限公司东湖分公司', 'address': '南昌市东湖区洪都北大道697号，330046', 'province': '江西省', 'city': '南昌市' } },
          { 'lng': 104.64396681, 'lat': 31.46557884, 'metadata': { 'name': '绵阳中达成宝汽车销售服务有限公司', 'address': '四川省绵阳市高新区汽车博览中心B-6', 'province': '四川省', 'city': '绵阳市' } },
          { 'lng': 118.42848048, 'lat': 31.48001787, 'metadata': { 'name': '芜湖宝利盛汽车销售服务有限公司', 'address': '安徽省芜湖市经济技术开发区九华北路112号邮编241000', 'province': '安徽省', 'city': '芜湖市' } },
          { 'lng': 111.51860405, 'lat': 36.06248850, 'metadata': { 'name': '临汾宝诚汽车销售服务有限公司', 'address': '山西省临汾市尧都区南外环机场路百业交通综合市场邮编041000', 'province': '山西省', 'city': '临汾市' } },
          { 'lng': 110.95296400, 'lat': 21.68930500, 'metadata': { 'name': '茂名市宝捷汽车销售服务有限公司', 'address': '广东省茂名市高水路288号（羊角路口爱群村委会旁）', 'province': '广东省', 'city': '茂名市' } },
          { 'lng': 116.63529800, 'lat': 40.10207200, 'metadata': { 'name': '北京美宝行汽车销售服务有限公司', 'address': '北京市顺义区仁和镇西环路99号院-4', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 116.38901400, 'lat': 39.95948100, 'metadata': { 'name': '北京博得宝汽车销售服务有限公司', 'address': '北京市西城区德胜门外教场口街4号，100120', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 130.23480496, 'lat': 46.80327935, 'metadata': { 'name': '佳木斯中宝汽车销售服务有限公司', 'address': '佳木斯市友谊路1333号邮编：154011', 'province': '黑龙江省', 'city': '佳木斯市' } },
          { 'lng': 113.25121616, 'lat': 23.09483888, 'metadata': { 'name': '广州宝泽汽车销售服务有限公司', 'address': '广州市荔湾区芳村大道东（广柴）146-1号', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 113.89520200, 'lat': 22.51464800, 'metadata': { 'name': '深圳市宝创汽车贸易有限公司南山分公司', 'address': '深圳市南山区月亮湾大道港城路和十号路交汇处邮编518051', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 116.31688825, 'lat': 39.87128145, 'metadata': { 'name': '北京宝泽行汽车销售服务有限公司', 'address': '北京市丰台区西三环南路59号邮编100071', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 112.52237540, 'lat': 23.10227260, 'metadata': { 'name': '肇庆市宝庆行汽车销售服务有限公司', 'address': '广东省肇庆市端州区东岗东路南侧126区（工业贸易学校北侧）邮编：526060', 'province': '广东省', 'city': '肇庆市' } },
          { 'lng': 114.25055833, 'lat': 22.73847543, 'metadata': { 'name': '深圳市创丰宝汽车销售服务有限公司', 'address': '深圳市龙岗区龙城街道盛平社区长兴北路6号邮编：518116', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 112.61994922, 'lat': 37.78102136, 'metadata': { 'name': '太原顺宝行汽车销售服务有限公司', 'address': '山西省太原市小店区龙城大街东段北侧，030031', 'province': '山西省', 'city': '太原市' } },
          { 'lng': 116.78161219, 'lat': 39.59472039, 'metadata': { 'name': '廊坊燕宝汽车销售服务有限公司', 'address': '廊坊经济技术开发区创业路22号邮编：065001', 'province': '河北省', 'city': '廊坊市' } },
          { 'lng': 106.15720300, 'lat': 38.45164800, 'metadata': { 'name': '银川宝辰行汽车销售服务有限公司', 'address': '宁夏回族自治区银川金凤工业园区750011', 'province': '宁夏回族自治区', 'city': '银川市' } },
          { 'lng': 113.55517700, 'lat': 22.38779000, 'metadata': { 'name': '珠海宝泽汽车销售服务有限公司拱北分公司', 'address': '广东省珠海市拱北情侣南路228号龙园雅苑192号邮编519015', 'province': '广东省', 'city': '珠海市' } },
          { 'lng': 120.83924200, 'lat': 29.56409000, 'metadata': { 'name': '嵊州市宝诚汽车销售服务有限公司', 'address': '嵊州市三江街道嵊州大道南1777-2号邮政编码：312400', 'province': '浙江省', 'city': '嵊州市' } },
          { 'lng': 116.73294291, 'lat': 23.37833958, 'metadata': { 'name': '汕头市宝悦汽车贸易有限公司', 'address': '广东省汕头市天山路74号邮编515041', 'province': '广东省', 'city': '汕头市' } },
          { 'lng': 104.03241273, 'lat': 30.59445057, 'metadata': { 'name': '四川中达成宝汽车销售有限公司', 'address': '四川成都市高新区火车南站西路1880号邮编610042', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 120.28827638, 'lat': 31.54790183, 'metadata': { 'name': '无锡宝诚汽车销售服务有限公司', 'address': '江苏省无锡市滨湖区五湖大道11-1号邮编214071', 'province': '江苏省', 'city': '无锡市' } },
          { 'lng': 108.26169200, 'lat': 22.85381200, 'metadata': { 'name': '南宁宝远汽车销售服务有限公司', 'address': '广西省南宁市科德西路27号,530000', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 117.03141100, 'lat': 36.65258700, 'metadata': { 'name': '济南大友宝汽车销售服务有限公司-舜耕路分公司', 'address': '山东省济南市历下区舜耕路6-2号，250014', 'province': '山东省', 'city': '济南市' } },
          { 'lng': 106.87300000, 'lat': 31.84385700, 'metadata': { 'name': '巴中兴孚宝汽车销售服务有限公司', 'address': '四川省巴中市经济开发区工业园区邮编：636024', 'province': '四川省', 'city': '巴中市' } },
          { 'lng': 116.66871700, 'lat': 39.87087100, 'metadata': { 'name': '北京正通宝泽汽车销售服务有限公司', 'address': '北京市通州区张家湾镇土桥村西（南院）2幢', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 86.22142700, 'lat': 41.72087400, 'metadata': { 'name': '库尔勒万宝行汽车销售服务有限公司', 'address': '新疆维吾尔自治区库尔勒市石化大道北侧神州国际汽车城841000', 'province': '新疆维吾尔自治区', 'city': '库尔勒市' } },
          { 'lng': 123.48492100, 'lat': 41.87281200, 'metadata': { 'name': '沈阳市宝晋汽车销售服务有限公司', 'address': '辽宁省沈阳市望花中街146号,110045', 'province': '辽宁省', 'city': '沈阳市' } },
          { 'lng': 105.44797852, 'lat': 28.86087023, 'metadata': { 'name': '泸州宝源汽车销售服务有限公司', 'address': '四川省泸州市蓝田轻工业园区川南国际汽车公园邮政编码：646000', 'province': '四川省', 'city': '泸州市' } },
          { 'lng': 108.85280100, 'lat': 34.33743500, 'metadata': { 'name': '西安顺宝行汽车销售服务有限公司', 'address': '西安市沣渭新区丰产路56号邮政编码：710086', 'province': '陕西省', 'city': '西安市' } },
          { 'lng': 116.08256500, 'lat': 36.47062000, 'metadata': { 'name': '聊城乾宝行汽车销售服务有限公司', 'address': '山东省聊城市经济技术开发区工业园支路6号', 'province': '山东省', 'city': '聊城市' } },
          { 'lng': 109.42914400, 'lat': 18.31466200, 'metadata': { 'name': '三亚粤宝汽车销售服务有限公司', 'address': '海南省三亚市凤凰镇机场路凤凰机场贵宾楼，572023', 'province': '海南省', 'city': '三亚市' } },
          { 'lng': 120.58830100, 'lat': 30.62349800, 'metadata': { 'name': '桐乡市宝昌汽车销售服务有限公司', 'address': '浙江省桐乡市中华路汽车商贸城三区3号', 'province': '浙江省', 'city': '桐乡市' } },
          { 'lng': 104.07400600, 'lat': 30.59631000, 'metadata': { 'name': '成都宝源行汽车销售服务有限公司', 'address': '四川省成都市高新区天府大道北段28号,610041', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 113.01936701, 'lat': 28.09271746, 'metadata': { 'name': '长沙力天宝崐汽车销售服务有限公司', 'address': '湖南省长沙市雨花区黄谷路888号，邮编：410014', 'province': '湖南省', 'city': '长沙市' } },
          { 'lng': 101.72630351, 'lat': 26.53274684, 'metadata': { 'name': '攀枝花恒孚宝汽车销售服务有限公司', 'address': '四川省攀枝花市仁和区攀枝花大道南段(新车管所旁),617061', 'province': '四川省', 'city': '攀枝花市' } },
          { 'lng': 113.01623800, 'lat': 23.70813000, 'metadata': { 'name': '清远粤宝汽车销售服务有限公司', 'address': '广东省清远市清城区清远大桥北桥头东侧', 'province': '广东省', 'city': '清远市' } },
          { 'lng': 118.61830300, 'lat': 24.75936200, 'metadata': { 'name': '泉州星德宝汽车销售服务有限责任公司', 'address': '福建省晋江市石泉路新塘良种场路段', 'province': '福建省', 'city': '泉州市' } },
          { 'lng': 118.88144200, 'lat': 31.98470000, 'metadata': { 'name': '南京中升之宝汽车销售服务有限公司', 'address': '江苏省南京市江宁区东麒路汽车工业园邮编211100', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 126.58057985, 'lat': 43.80537624, 'metadata': { 'name': '吉林鑫汇宝汽车销售服务有限公司', 'address': '吉林市高新区南山街3399号，132013', 'province': '吉林省', 'city': '吉林市' } },
          { 'lng': 120.05941203, 'lat': 28.91324376, 'metadata': { 'name': '永康市宝驿汽车销售服务有限公司', 'address': '浙江省永康市东城街道花园大道1011号，321300', 'province': '浙江省', 'city': '永康市' } },
          { 'lng': 120.09103589, 'lat': 29.32727822, 'metadata': { 'name': '义乌泓宝行汽车销售服务有限公司', 'address': '浙江省义乌市城中北路267号邮编：322000', 'province': '浙江省', 'city': '义乌市' } },
          { 'lng': 119.76262800, 'lat': 49.12573200, 'metadata': { 'name': '呼伦贝尔威宝汽车销售服务有限公司', 'address': '内蒙古自治区呼伦贝尔市鄂温克自治旗巴彦拓海镇物流园（广惠寺东侧）', 'province': '内蒙古自治区', 'city': '呼伦贝尔市' } },
          { 'lng': 114.02295786, 'lat': 33.58762994, 'metadata': { 'name': '漯河漯德宝汽车销售服务有限公司', 'address': '漯河市名车大道与桂江路交叉口向南100米,462000', 'province': '河南省', 'city': '漯河市' } },
          { 'lng': 103.63747500, 'lat': 36.14484200, 'metadata': { 'name': '兰州宝鑫行汽车销售服务有限公司', 'address': '甘肃省兰州市安宁区北滨河西路88号（沙井驿街道办事处旁)邮编：730079', 'province': '甘肃省', 'city': '兰州市' } },
          { 'lng': 119.12524900, 'lat': 33.61917400, 'metadata': { 'name': '淮安润宝行汽车销售服务有限公司', 'address': '江苏省淮安市清河新区旺旺路70号，223001', 'province': '江苏省', 'city': '淮安市' } },
          { 'lng': 120.81842979, 'lat': 31.34505364, 'metadata': { 'name': '苏州市宝景汽车销售服务有限公司', 'address': '江苏省苏州市工业园区双圩路145号,215000', 'province': '江苏省', 'city': '苏州市' } },
          { 'lng': 120.69712938, 'lat': 27.81046963, 'metadata': { 'name': '瑞安市宝隆汽车销售服务有限公司', 'address': '浙江省瑞安市104国道汀田镇金凤路88号邮编325300', 'province': '浙江省', 'city': '瑞安市' } },
          { 'lng': 117.22420806, 'lat': 39.22871326, 'metadata': { 'name': '天津宝信汽车销售服务有限公司', 'address': '天津市北辰区宜兴埠津围公路3号邮编:300402', 'province': '天津市', 'city': '天津市' } },
          { 'lng': 113.86111200, 'lat': 22.56823000, 'metadata': { 'name': '深圳市驰宝汽车销售服务有限公司', 'address': '深圳市宝安区西乡大道大铲湾港区金湾二段168－6号邮政编码：518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 120.07381541, 'lat': 30.88289300, 'metadata': { 'name': '湖州骏宝行汽车销售服务有限公司', 'address': '湖州市吴兴区杭长桥北路1288号邮政编码：313000', 'province': '浙江省', 'city': '湖州市' } },
          { 'lng': 115.85997700, 'lat': 28.62181400, 'metadata': { 'name': '南昌和诚之宝汽车销售服务有限公司', 'address': '江西省南昌市西湖区抚生路1588号邮编330025', 'province': '江西省', 'city': '南昌市' } },
          { 'lng': 114.42084500, 'lat': 23.08230900, 'metadata': { 'name': '惠州合宝汽车销售服务有限公司---第一分公司', 'address': '广东省惠州市惠城区麦地南路28号,邮编：516000', 'province': '广东省', 'city': '惠州市' } },
          { 'lng': 109.46213800, 'lat': 30.28855400, 'metadata': { 'name': '恩施顺德宝汽车销售服务有限公司', 'address': '湖北省恩施六角亭街道办事处松树坪村国际汽车城，445000', 'province': '湖北省', 'city': '恩施市' } },
          { 'lng': 113.31154934, 'lat': 23.11517484, 'metadata': { 'name': '广东粤宝汽车销售服务有限公司第三分公司', 'address': '广州市越秀区二沙岛烟雨路亚洲羽毛球培训中心北侧1楼邮编：510105', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 104.88262400, 'lat': 25.09684500, 'metadata': { 'name': '黔西南州宝源汽车销售服务有限公司', 'address': '贵州省黔西南布依族苗族自治州兴义市青龙西路1号', 'province': '贵州省', 'city': '兴义市' } },
          { 'lng': 121.08266200, 'lat': 31.36899600, 'metadata': { 'name': '昆山骏宝行汽车销售服务有限公司', 'address': '江苏省昆山经济技术开发区昆嘉路1500号,215300', 'province': '江苏省', 'city': '昆山市' } },
          { 'lng': 120.68670200, 'lat': 30.91223700, 'metadata': { 'name': '苏州盛泽宝致行汽车销售服务有限公司', 'address': '江苏省苏州市吴江区盛泽镇东环路大东村（东侧）', 'province': '江苏省', 'city': '吴江市' } },
          { 'lng': 121.37712100, 'lat': 31.24134000, 'metadata': { 'name': '上海普陀宝泓二手车销售服务有限公司', 'address': '上海市普陀区金沙江路2087号', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 113.89739600, 'lat': 22.59573400, 'metadata': { 'name': '深圳市宝创汽车贸易有限公司宝安分公司', 'address': '深圳市宝安区西乡大道与锦花路交汇处正泰商业大厦1楼,518100', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '南宁中达桂之宝汽车销售服务有限公司', 'address': '南宁市邕宁区龙岗大道天坛路30号,530200', 'province': '广西壮族自治区', 'city': '南宁市' } },
          { 'lng': 120.39940300, 'lat': 36.13301800, 'metadata': { 'name': '青岛德宝佳汽车销售服务有限公司', 'address': '山东省青岛市市北区重庆南路209号,266044', 'province': '山东省', 'city': '青岛市' } },
          { 'lng': 118.66310100, 'lat': 31.95003500, 'metadata': { 'name': '南京万宝行汽车销售服务有限公司', 'address': '江苏省南京市雨花台区雨花经济开发区雨花国际汽贸园,210000', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 106.95571800, 'lat': 27.72115400, 'metadata': { 'name': '遵义宝源汽车销售服务有限公司-汇川区分公司', 'address': '贵州省遵义长沙路汽车城A区1层,563000', 'province': '贵州省', 'city': '遵义市' } },
          { 'lng': 81.37316600, 'lat': 43.89345000, 'metadata': { 'name': '伊犁宝业汽车销售服务有限公司', 'address': '新疆伊犁州伊宁市南环路2号,835000', 'province': '新疆维吾尔自治区', 'city': '伊犁州市' } },
          { 'lng': 121.24909281, 'lat': 30.13644072, 'metadata': { 'name': '慈溪宝恒汽车销售服务有限公司', 'address': '浙江省慈溪市横河镇杨梅大道北路333号邮编315318', 'province': '浙江省', 'city': '慈溪市' } },
          { 'lng': 120.94501099, 'lat': 28.07661412, 'metadata': { 'name': '温州宝诚汽车销售服务有限公司', 'address': '浙江省乐清市柳乐路2111号邮编：325604', 'province': '浙江省', 'city': '乐清市' } },
          { 'lng': 104.03585900, 'lat': 30.64376100, 'metadata': { 'name': '成都中宝汽车销售服务有限公司', 'address': '四川省成都市武侯区金花镇江安河村2社1239号邮政编码：610000', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 111.64187600, 'lat': 26.29941500, 'metadata': { 'name': '永州美宝行汽车销售服务有限公司', 'address': '湖南省永州市零陵区零陵大道潇湘汽车城东区,425000', 'province': '湖南省', 'city': '永州市' } },
          { 'lng': 119.07192300, 'lat': 32.02545500, 'metadata': { 'name': '南京协众麒宝汽车销售服务有限公司', 'address': '南京市江宁区汤山街道汤山大道与天润路交叉口211131', 'province': '江苏省', 'city': '南京市' } },
          { 'lng': 117.92995500, 'lat': 37.36323400, 'metadata': { 'name': '滨州宝通汽车销售服务有限公司', 'address': '山东省滨州市渤海路二十四路以西长江三路以南429号邮编：256603', 'province': '山东省', 'city': '滨州市' } },
          { 'lng': 115.01621000, 'lat': 27.09845000, 'metadata': { 'name': '抚州市宝晋汽车销售服务有限公司吉安分公司', 'address': '江西省吉安市青原区青原大道盛唐华都1栋102B商铺', 'province': '江西省', 'city': '抚州市' } },
          { 'lng': 113.44320277, 'lat': 31.70942536, 'metadata': { 'name': '随州恒信之宝汽车销售服务有限公司', 'address': '湖北省随州市高新区鹿鹤大道与五星路交汇口', 'province': '湖北省', 'city': '随州市' } },
          { 'lng': 107.35188300, 'lat': 34.35487200, 'metadata': { 'name': '宝鸡燕德宝汽车销售服务有限公司', 'address': '陕西省宝鸡市陈仓区南环路会展中心东200米721300', 'province': '陕西省', 'city': '宝鸡市' } },
          { 'lng': 121.38814100, 'lat': 28.56124600, 'metadata': { 'name': '台州好德宝汽车服务有限公司', 'address': '浙江台州市路桥区西迎宾大道11号邮编318050', 'province': '浙江省', 'city': '台州市' } },
          { 'lng': 109.13073800, 'lat': 21.43296500, 'metadata': { 'name': '北海粤宝汽车销售服务有限公司', 'address': '北海市银海区金海岸大道28号', 'province': '广西壮族自治区', 'city': '北海市' } },
          { 'lng': 113.05834700, 'lat': 34.79316400, 'metadata': { 'name': '巩义市义德宝汽车销售服务有限公司', 'address': '河南省巩义市站街镇集沟村河洛路与S237路交叉口,451261', 'province': '河南省', 'city': '巩义市' } },
          { 'lng': 99.20366600, 'lat': 25.14325900, 'metadata': { 'name': '保山宝远汽车销售服务有限公司', 'address': '云南省保山市隆阳区永昌街道永昌路延长线下村工业园区龙马药业商铺，678000', 'province': '云南省', 'city': '保山市' } },
          { 'lng': 117.96119600, 'lat': 28.41050500, 'metadata': { 'name': '上饶市美宝行汽车销售服务有限公司', 'address': '江西省上饶市信州区上饶大道18号3幢2-1.334000', 'province': '江西省', 'city': '上饶市' } },
          { 'lng': 114.24719700, 'lat': 29.88237800, 'metadata': { 'name': '咸宁恒信宝汽车销售服务有限公司', 'address': '湖北咸宁经济开发区咸潘公路旁1幢，437100', 'province': '湖北省', 'city': '咸宁市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '深圳华顺宝汽车服务有限公司', 'address': '深圳市罗湖区宝岗路241号，518000', 'province': '广东省', 'city': '深圳市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '宿州美宝行汽车销售服务有限公司', 'address': '安徽省宿州市埇桥区东十里汽车城内仁和路与凤鸣路交叉口，234000', 'province': '安徽省', 'city': '宿州市' } },
          { 'lng': 119.82509900, 'lat': 31.28292300, 'metadata': { 'name': '宜兴金昌宝顺汽车销售服务有限公司', 'address': '江苏省宜兴市丁蜀镇104国道东侧', 'province': '江苏省', 'city': '宜兴市' } },
          { 'lng': 111.34277300, 'lat': 30.72945900, 'metadata': { 'name': '宜昌宝泽汽车销售服务有限公司宜昌高新区分公司', 'address': '湖北省宜昌开发区发展大道92号', 'province': '湖北省', 'city': '宜昌市' } },
          { 'lng': 116.07617691, 'lat': 24.29318264, 'metadata': { 'name': '梅州中宝汽车销售服务有限公司', 'address': '广东省梅县扶大高新区广梅南路288号邮编：514000', 'province': '广东省', 'city': '梅州市' } },
          { 'lng': 116.49035600, 'lat': 40.01801600, 'metadata': { 'name': '北京盈之宝汽车销售服务有限公司', 'address': '北京市朝阳区利泽东二路二号邮编:100102', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 119.93674077, 'lat': 28.46932729, 'metadata': { 'name': '丽水宝顺行汽车销售服务有限公司', 'address': '丽水市庆春街767号,邮编323000', 'province': '浙江省', 'city': '丽水市' } },
          { 'lng': 116.25953743, 'lat': 40.05660571, 'metadata': { 'name': '北京宝诚百旺汽车销售服务有限公司', 'address': '海淀区西北旺镇百旺绿谷汽车园F2地块邮编：100094', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 116.54043000, 'lat': 39.87627500, 'metadata': { 'name': '北京翼翔行汽车销售服务有限公司', 'address': '北京市朝阳区王四营乡马房寺村334号', 'province': '北京市', 'city': '北京市' } },
          { 'lng': 109.22735600, 'lat': 27.72456800, 'metadata': { 'name': '铜仁通源宝源汽车销售服务有限公司', 'address': '贵州省铜仁市碧江区城市快速道路南部片区睿力国际城B区,554400', 'province': '贵州省', 'city': '铜仁市' } },
          { 'lng': 110.42439100, 'lat': 19.99259000, 'metadata': { 'name': '海南宝翔行汽车销售服务有限公司', 'address': '海南省海口市美兰区琼山大道289-9号', 'province': '海南省', 'city': '海口市' } },
          { 'lng': 110.32580309, 'lat': 21.29641348, 'metadata': { 'name': '湛江中升之宝汽车销售服务有限公司', 'address': '广东省湛江市麻章区325国道与瑞云北路交界处北乐坑村段（荣盛南亚郦都旁）邮编：524003', 'province': '广东省', 'city': '湛江市' } },
          { 'lng': 121.38572013, 'lat': 28.40694233, 'metadata': { 'name': '台州力宝行汽车销售服务有限公司', 'address': '浙江省温岭市九龙大道与万昌中路交叉口邮编：317500', 'province': '浙江省', 'city': '温岭市' } },
          { 'lng': 121.45693009, 'lat': 31.15793245, 'metadata': { 'name': '上海徐汇宝信汽车服务有限公司', 'address': '上海徐汇区龙吴路900号4幢邮编：200232', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 121.15798900, 'lat': 28.82715300, 'metadata': { 'name': '临海宝诚汽车销售服务有限公司', 'address': '浙江省临海市靖江南路116号邮编：317000', 'province': '浙江省', 'city': '临海市' } },
          { 'lng': 119.07372800, 'lat': 34.59489800, 'metadata': { 'name': '连云港之宝汽车销售服务有限公司', 'address': '连云港市海州区港埠农场新浦工业园浙江路8号', 'province': '江苏省', 'city': '连云港市' } },
          { 'lng': 109.86943923, 'lat': 40.63884006, 'metadata': { 'name': '包头市宝泽汽车销售服务有限公司', 'address': '内蒙古自治区包头市高新区稀土路41号邮编：014010', 'province': '内蒙古自治区', 'city': '包头市' } },
          { 'lng': 118.29269180, 'lat': 35.01841818, 'metadata': { 'name': '临沂宇宝行汽车销售服务有限公司', 'address': '山东省临沂市罗庄区沂河路与湖东路交汇处邮编276000', 'province': '山东省', 'city': '临沂市' } },
          { 'lng': 120.22337584, 'lat': 30.21281686, 'metadata': { 'name': '杭州骏宝行汽车销售服务有限公司', 'address': '浙江省杭州市滨江区江陵路1740号邮编310051', 'province': '浙江省', 'city': '杭州市' } },
          { 'lng': 118.58803079, 'lat': 24.80102627, 'metadata': { 'name': '泉州晋宝汽车销售服务有限公司', 'address': '福建省晋江市和平中路38号邮编：362200', 'province': '福建省', 'city': '泉州市' } },
          { 'lng': 116.94987600, 'lat': 36.69770800, 'metadata': { 'name': '济南万宝行汽车销售服务有限公司', 'address': '山东省济南市槐荫区济齐路89号，250023', 'province': '山东省', 'city': '济南市' } },
          { 'lng': 113.53557715, 'lat': 34.81009327, 'metadata': { 'name': '郑州宝莲祥汽车销售服务有限公司', 'address': '郑州市高新区科学大道与西四环交汇处南600米邮编：450042', 'province': '河南省', 'city': '郑州市' } },
          { 'lng': 113.16096000, 'lat': 23.00983500, 'metadata': { 'name': '佛山通宝汽车销售服务有限公司', 'address': '广东省佛山市南海区桂城石(石肯)三、四村桂澜路段,528200', 'province': '广东省', 'city': '佛山市' } },
          { 'lng': 114.89473058, 'lat': 25.84988429, 'metadata': { 'name': '赣州宝泽汽车销售服务有限公司', 'address': '江西省赣州市赣州开发区金潭大道16号邮编：341000', 'province': '江西省', 'city': '赣州市' } },
          { 'lng': 119.56530666, 'lat': 26.64754643, 'metadata': { 'name': '宁德中宝汽车销售服务有限公司', 'address': '福建省宁德市东侨经济开发区万安东路9号邮政编码：352100', 'province': '福建省', 'city': '宁德市' } },
          { 'lng': 121.50582800, 'lat': 31.20655300, 'metadata': { 'name': '上海凡德汽车销售服务有限公司-中山南路分公司', 'address': '上海市黄浦区苗江路123号，200011', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 121.44388900, 'lat': 30.14216400, 'metadata': { 'name': '慈溪宝恒东悦汽车维修服务有限公司', 'address': '浙江省宁波市慈溪县市掌起镇慈掌路729号，315313', 'province': '浙江省', 'city': '慈溪市' } },
          { 'lng': 114.33042000, 'lat': 30.48366100, 'metadata': { 'name': '武汉中达江宝南湖汽车销售服务有限公司', 'address': '武汉市洪山区野芷湖西路10号，430073', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 112.63920139, 'lat': 33.02246193, 'metadata': { 'name': '南阳宛德宝汽车销售服务有限公司', 'address': '河南省南阳市南阳大桥向东一公里路北,473000', 'province': '河南省', 'city': '南阳市' } },
          { 'lng': 118.08116053, 'lat': 36.85453645, 'metadata': { 'name': '淄博圣宝汽车销售服务有限公司', 'address': '山东省淄博市张店区金晶大道196号邮编：255000', 'province': '山东省', 'city': '淄博市' } },
          { 'lng': 119.50283300, 'lat': 31.46655000, 'metadata': { 'name': '溧阳宝尊汽车销售服务有限公司', 'address': '溧阳市城北大道20号1幢邮编：213300', 'province': '江苏省', 'city': '溧阳市' } },
          { 'lng': 119.43120900, 'lat': 26.02880900, 'metadata': { 'name': '福建中升汇宝汽车销售服务有限公司', 'address': '福建省福州市马尾区兴业东路21号,350015', 'province': '福建省', 'city': '福州市' } },
          { 'lng': 120.73983101, 'lat': 31.70615519, 'metadata': { 'name': '常熟宝信汽车销售服务有限公司', 'address': '江苏省常熟市珠海路9号邮编215500', 'province': '江苏省', 'city': '常熟市' } },
          { 'lng': 113.04893735, 'lat': 28.17553820, 'metadata': { 'name': '长沙瑞宝汽车销售服务有限公司', 'address': '湖南省长沙市雨花区长沙大道688号邮编410014', 'province': '湖南省', 'city': '长沙市' } },
          { 'lng': 121.36941057, 'lat': 37.48803670, 'metadata': { 'name': '烟台中达翔宝汽车销售服务有限公司', 'address': '烟台市福山区机场路609号265500', 'province': '山东省', 'city': '烟台市' } },
          { 'lng': 120.31139942, 'lat': 31.89768815, 'metadata': { 'name': '江阴宝诚汽车销售服务有限公司', 'address': '江苏省江阴市澄杨路77号邮编214400', 'province': '江苏省', 'city': '江阴市' } },
          { 'lng': 104.77788838, 'lat': 31.42757544, 'metadata': { 'name': '绵阳宝仁汽车销售服务有限公司', 'address': '绵阳市经开区绵州大道中段6号同立汽车博览中心邮编：511440', 'province': '四川省', 'city': '绵阳市' } },
          { 'lng': 119.16813404, 'lat': 36.71312622, 'metadata': { 'name': '潍坊圣宝汽车销售服务有限公司', 'address': '山东省潍坊市高新区北海路719号邮政编码：261071', 'province': '山东省', 'city': '潍坊市' } },
          { 'lng': 103.98010100, 'lat': 30.61038500, 'metadata': { 'name': '成都祺宝汽车销售服务有限公司', 'address': '成都市武侯区成双大道中段968号', 'province': '四川省', 'city': '成都市' } },
          { 'lng': 114.69658200, 'lat': 33.65755600, 'metadata': { 'name': '周口周德宝汽车销售服务有限公司', 'address': '河南省周口市川汇区北环路东段路北，466000', 'province': '河南省', 'city': '周口市' } },
          { 'lng': 100.31097300, 'lat': 25.61479000, 'metadata': { 'name': '大理宝远汽车销售服务有限公司', 'address': '云南省大理市凤仪镇千户营村丰赢汽车城', 'province': '云南省', 'city': '大理市' } },
          { 'lng': 112.53335400, 'lat': 37.76678500, 'metadata': { 'name': '太原驰宝汽车销售服务有限公司', 'address': '山西省太原市晋源区健康北街9号', 'province': '山西省', 'city': '太原市' } },
          { 'lng': 114.24389508, 'lat': 30.74478623, 'metadata': { 'name': '武汉鄂宝汽车销售服务有限公司', 'address': '湖北省武汉市黄陂区盘龙城经济发展区盘龙汽车城邮编430312', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 125.26508364, 'lat': 43.82629992, 'metadata': { 'name': '长春汇宝汽车销售服务有限公司', 'address': '吉林省长春市高新开发区硅谷大街3000号邮编130012', 'province': '吉林省', 'city': '长春市' } },
          { 'lng': 120.74076041, 'lat': 27.96802849, 'metadata': { 'name': '温州好德宝汽车服务有限公司', 'address': '浙江省温州市龙湾区蒲州街道高一路23号，325000', 'province': '浙江省', 'city': '温州市' } },
          { 'lng': 118.04867891, 'lat': 36.78311905, 'metadata': { 'name': '淄博宝通汽车销售服务有限公司', 'address': '山东省淄博市张店区山泉路68号邮政编码：255020', 'province': '山东省', 'city': '淄博市' } },
          { 'lng': 115.98322329, 'lat': 29.71078782, 'metadata': { 'name': '九江中顺宝汽车销售服务有限公司', 'address': '江西省九江市九瑞大道240号332005', 'province': '江西省', 'city': '九江市' } },
          { 'lng': 114.37835239, 'lat': 30.38227733, 'metadata': { 'name': '武汉中达江宝汽车销售服务有限公司', 'address': '湖北省武汉市江夏区庙山开发区武汉汽车公园430213', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 111.72327300, 'lat': 28.94461800, 'metadata': { 'name': '常德市美宝行汽车销售服务有限公司', 'address': '湖南省常德市经济技术开发区德山镇樟木桥居委会常德大道677号（常龙加油站旁）', 'province': '湖南省', 'city': '常德市' } },
          { 'lng': 120.55840800, 'lat': 29.99687100, 'metadata': { 'name': '绍兴泓宝行汽车销售服务有限公司', 'address': '浙江省绍兴市越城区城南大道1515号，312000', 'province': '浙江省', 'city': '绍兴市' } },
          { 'lng': 121.84602600, 'lat': 39.05142200, 'metadata': { 'name': '大连驰宝汽车销售服务有限公司', 'address': '辽宁省大连市大连保税区护港路9号邮编：116600', 'province': '辽宁省', 'city': '大连市' } },
          { 'lng': 119.43348100, 'lat': 25.67938000, 'metadata': { 'name': '福清信达通宝汽车销售服务有限公司', 'address': '福建省福清市海口镇洋坂村168号350313', 'province': '福建省', 'city': '福清市' } },
          { 'lng': 114.83731200, 'lat': 25.74892100, 'metadata': { 'name': '赣州市宝晋汽车销售服务有限公司', 'address': '江西省赣州市南康区龙岭镇赣南汽车城，341000', 'province': '江西省', 'city': '赣州市' } },
          { 'lng': 114.39483800, 'lat': 38.08013100, 'metadata': { 'name': '石家庄市诚宝行汽车销售服务有限公司', 'address': '河北省石家庄市古城西路河北康恒国际汽车园区B区5号，050021', 'province': '河北省', 'city': '石家庄市' } },
          { 'lng': 106.95570100, 'lat': 27.72106700, 'metadata': { 'name': '遵义宝源汽车销售服务有限公司', 'address': '贵州省遵义市红花岗区高新技术产业园内,邮编：563000', 'province': '贵州省', 'city': '遵义市' } },
          { 'lng': 116.38596200, 'lat': 37.46256500, 'metadata': { 'name': '德州圣宝汽车销售服务有限公司', 'address': '德州经济开发区晶华路253034', 'province': '山东省', 'city': '德州市' } },
          { 'lng': 121.41586057, 'lat': 29.72706284, 'metadata': { 'name': '宁波金昌宝顺汽车销售服务有限公司', 'address': '奉化市江口街道江宁路182号邮编：315500', 'province': '浙江省', 'city': '宁波市' } },
          { 'lng': 120.45361000, 'lat': 31.93805100, 'metadata': { 'name': '张家港龙之宝汽车销售服务有限公司', 'address': '江苏省张家港市张家港保税港区晨丰公路888号，215600', 'province': '江苏省', 'city': '张家港市' } },
          { 'lng': 114.44571400, 'lat': 30.49260800, 'metadata': { 'name': '武汉恒信之宝汽车销售服务有限公司', 'address': '湖北省武汉市东湖高新技术开发区光谷一路205号，430000', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 119.21037800, 'lat': 34.57938600, 'metadata': { 'name': '连云港之宝汽车销售服务有限公司-海州开发区分公司', 'address': '连云港市海州开发区郁洲南路1-1号，222000', 'province': '江苏省', 'city': '连云港市' } },
          { 'lng': 117.01895600, 'lat': 36.65419000, 'metadata': { 'name': '济南大友宝汽车销售服务有限公司体育中心分公司', 'address': '山东省济南市经十路20286号，250002', 'province': '山东省', 'city': '济南市' } },
          { 'lng': 120.20125700, 'lat': 29.74948900, 'metadata': { 'name': '诸暨宝顺汽车销售服务有限公司', 'address': '浙江省诸暨市北二环路16-2号', 'province': '浙江省', 'city': '诸暨市' } },
          { 'lng': 126.56596600, 'lat': 45.88638800, 'metadata': { 'name': '哈尔滨宝诚汽车销售服务有限公司', 'address': '黑龙江省哈尔滨市利民开发区利民大道永达汽车广场,150025', 'province': '黑龙江省', 'city': '哈尔滨市' } },
          { 'lng': 112.07177000, 'lat': 22.95822000, 'metadata': { 'name': '云浮粤宝汽车销售服务有限公司', 'address': '广东省云浮市云城区环市东路28号', 'province': '广东省', 'city': '云浮市' } },
          { 'lng': 123.36754200, 'lat': 41.81942200, 'metadata': { 'name': '启东聚宝行汽车销售服务有限公司', 'address': '江苏省启东市人民西路3353号,226200', 'province': '江苏省', 'city': '启东市' } },
          { 'lng': 114.70466900, 'lat': 23.70179800, 'metadata': { 'name': '河源市宝星汽车销售服务有限公司', 'address': '广东省河源市源城区滨江大道中1号', 'province': '广东省', 'city': '河源市' } },
          { 'lng': 117.13739900, 'lat': 29.32419800, 'metadata': { 'name': '景德镇美宝行汽车销售服务有限公司', 'address': '江西省景德镇市赣东北物流园国大汽车城，333000', 'province': '江西省', 'city': '景德镇市' } },
          { 'lng': 113.07454079, 'lat': 22.62729471, 'metadata': { 'name': '江门市合宝汽车销售服务有限公司', 'address': '广东省江门市蓬江区建设三路95号邮编：529000', 'province': '广东省', 'city': '江门市' } },
          { 'lng': 119.09294678, 'lat': 33.57211821, 'metadata': { 'name': '淮安宝景汽车销售服务有限公司', 'address': '江苏省淮安经济开发区翔宇大道21号邮编：223005', 'province': '江苏省', 'city': '淮安市' } },
          { 'lng': 124.88545449, 'lat': 45.09462652, 'metadata': { 'name': '松原中顺宝汽车销售服务有限公司', 'address': '吉林省松原市郭尔罗斯大路7899号邮编：138000', 'province': '吉林省', 'city': '松原市' } },
          { 'lng': 111.70018097, 'lat': 40.86799097, 'metadata': { 'name': '呼和浩特市祺宝汽车销售服务有限公司', 'address': '内蒙古自治区呼和浩特市新城区兴安北路36号邮编010070', 'province': '内蒙古自治区', 'city': '呼和浩特市' } },
          { 'lng': 121.27437563, 'lat': 31.00841482, 'metadata': { 'name': '上海宝景星诚汽车销售服务有限公司', 'address': '上海市松江区北松公路7168号邮编：201611', 'province': '上海市', 'city': '上海市' } },
          { 'lng': 114.54455400, 'lat': 36.62035900, 'metadata': { 'name': '邯郸市车悦宝汽车服务有限公司', 'address': '河北省邯郸市丛台路与东环路交口西南角江泉大厦一层,056002', 'province': '河北省', 'city': '邯郸市' } },
          { 'lng': 105.01378100, 'lat': 29.57858900, 'metadata': { 'name': '内江祥孚宝汽车销售服务有限公司', 'address': '四川省内江市市中区汉渝大道1636号,641000', 'province': '四川省', 'city': '内江市' } },
          { 'lng': 118.12622200, 'lat': 39.65495200, 'metadata': { 'name': '唐山中升之宝汽车销售服务有限公司', 'address': '河北省唐山市路北区站前路与长虹道交叉口,063000', 'province': '河北省', 'city': '唐山市' } },
          { 'lng': 114.26921500, 'lat': 30.55590700, 'metadata': { 'name': '武汉恒信悦宝汽车销售服务有限公司', 'address': '武汉市汉阳区汉阳大道孟家铺172号，430051', 'province': '湖北省', 'city': '武汉市' } },
          { 'lng': 119.76733000, 'lat': 29.82940900, 'metadata': { 'name': '桐庐宝之驿汽车销售服务有限公司', 'address': '浙江省桐庐市经济开发区兴宁西路108号,', 'province': '浙江省', 'city': '桐庐市' } },
          { 'lng': 113.35868300, 'lat': 22.99799800, 'metadata': { 'name': '广州宝泰行汽车销售服务有限公司', 'address': '广州市番禺区兴业大道1号511442', 'province': '广东省', 'city': '广州市' } },
          { 'lng': 103.69306100, 'lat': 36.09565500, 'metadata': { 'name': '兰州新丰泰华宝汽车销售服务有限公司', 'address': '甘肃省兰州市七里河区南滨河中路1369号，730050', 'province': '甘肃省', 'city': '兰州市' } },
          { 'lng': 0.00000000, 'lat': 0.00000000, 'metadata': { 'name': '铜陵美宝行汽车销售服务有限公司', 'address': '安徽省铜陵市狮子山区国际汽车城，244000', 'province': '安徽省', 'city': '铜陵市' } },
          { 'lng': 120.23466200, 'lat': 32.00623600, 'metadata': { 'name': '靖江龙之宝汽车销售服务有限公司', 'address': '江苏省靖江市中洲西路国际汽车城,214500', 'province': '江苏省', 'city': '靖江市' } },
          { 'lng': 118.76530600, 'lat': 37.44589400, 'metadata': { 'name': '东营广宝汽车销售服务有限公司', 'address': '东营市东营区东八路79号', 'province': '山东省', 'city': '东营市' } },
          { 'lng': 114.11023100, 'lat': 22.85044800, 'metadata': { 'name': '东莞美宝行汽车销售服务有限公司', 'address': '广东省东莞市塘厦镇林村林东三路1号B，523711', 'province': '广东省', 'city': '东莞市' } }
        ]
      };
    },
    mounted () {
      this.$on('getPositionComplete', (res) => {
        this.isPosition = true;
        this.myLocal = res;
        this.cchange2(res.address.province, res.address.city);
        this.showAllPoint();
      });
      this.$on('getPositionFailed', (res) => {
        this.cchange2(res.address.province, res.address.city);
        this.showAllPoint();
      });
      this.initCity();
    },
    methods: {
      showPop () {
        this.isPop = true;
      },
      closePop () {
        this.isPop = false;
      },
      GetDistance (lat1, lng1, lat2, lng2) {
        // var EARTH_RADIUS = 6378137.0;
        // var PI = Math.PI;
        var radLat1 = lat1 * Math.PI / 180.0;
        var radLat2 = lat2 * Math.PI / 180.0;
        var a = radLat1 - radLat2;
        var  b = lng1 * Math.PI / 180.0 - lng2 * Math.PI / 180.0;
        var s = 2 * Math.asin(Math.sqrt(Math.pow(Math.sin(a/2), 2) + Math.cos(radLat1) * Math.cos(radLat2) * Math.pow(Math.sin(b/2), 2)));
        s = s * 6378.137 ;
        s = Math.round(s * 10000) / 10000;
        return s;
      },
      sortNumber (a,b) {
        return a[1]-b[1]
      },
      carChange () {
        console.log('here');
        for (let i = 0; i < this.carType.length; i++) {
          if (this.carType[i].type === this.myCarType) {
            this.carModel = this.carType[i].subs;
            this.myCarModel = this.carType[i].subs[0].model;
          }
        }
      },
      initCity () {
        this.province = ['全部'];
        for (let i = 0; i < this.allStore.length; i++) {
          if (this.province.indexOf(this.allStore[i].metadata.province) === -1) {
            this.province.push(this.allStore[i].metadata.province);
          }
        }
      },
      schange () {
        // console.log(this.myProvince);
        this.city = [];
        this.myCity = '';

        for (let i = 0; i < this.allStore.length; i++) {
          if (this.myProvince === this.allStore[i].metadata.province && this.city.indexOf(this.allStore[i].metadata.city) === -1) {
            this.city.push(this.allStore[i].metadata.city);
            if (this.myCity === '') {
              this.myCity = this.allStore[i].metadata.city;
              this.cchange();
            }
          }
        }
      },
      // 选择选项调用的
      cchange () {
        this.store = [];
        this.myStore = '';
        this.resPoints = [];
        for (let i = 0; i < this.allStore.length; i++) {
          if (this.myProvince === this.allStore[i].metadata.province && this.myCity === this.allStore[i].metadata.city) {
            this.store.push(this.allStore[i].metadata.name);
            if (this.myStore === '') this.myStore = this.allStore[i].metadata.name;
            this.resPoints.push({ 'lng': this.allStore[i].lng, 'lat': this.allStore[i].lat, 'metadata': this.allStore[i].metadata });
          }
        }
        // console.log('cchange', this.resPoints);
        this.$emit('setZoomCenter', this.resPoints);
      },
      // 定位后调用的
      cchange2 (provinceName, cityName) {
        this.myProvince = provinceName;
        this.myCity = cityName;
        if (this.isPosition){
          var city_range = [];
        }
        this.store = [];
        this.resPoints = [];
        for (let i = 0; i < this.allStore.length; i++) {
          if (this.myProvince === this.allStore[i].metadata.province && this.city.indexOf(this.allStore[i].metadata.city) === -1) {
            this.city.push(this.allStore[i].metadata.city);
          }
        }

        this.myStore = '';
        for (let i = 0; i < this.allStore.length; i++) {
          if (this.myProvince === this.allStore[i].metadata.province && this.myCity === this.allStore[i].metadata.city) {
            this.store.push(this.allStore[i].metadata.name);
            if (this.isPosition) city_range.push([this.allStore[i].metadata.name, this.GetDistance(this.allStore[i].lat, this.allStore[i].lng, this.myLocal.point.lat, this.myLocal.point.lng)])
            if (this.myStore === '') { if (!this.isPosition) this.myStore = this.allStore[i].metadata.name; }
            this.resPoints.push({ 'lng': this.allStore[i].lng, 'lat': this.allStore[i].lat, 'metadata': this.allStore[i].metadata });
          }
        }

        if (this.isPosition) {
          let newArray = city_range.sort(this.sortNumber);
          this.store = [];
          for (let i = 0; i < newArray.length; i++) {
            this.store.push(newArray[i][0]);
            if (this.myStore === '') this.myStore = newArray[i][0];
          }
          this.$emit('setCenter', {'lat':this.myLocal.point.lat, 'lng': this.myLocal.point.lng}, 13);
        }else{
          this.$emit('setZoomCenter', this.resPoints);
        }
      },
      showPoint () {
        // console.log(this.myStore);
        for (let i = 0; i < this.allStore.length; i++) {
          if (this.myStore === this.allStore[i].metadata.name) {
            this.$emit('openWindow', this.allStore[i]);
          }
        }
      },
      showAllPoint () {
        this.$emit('addOverlay', this.allStore);
      },
      submitForm (e) {
        return;
      }
      // 结束，没有了
    }
  };
</script>

<style scoped lang=less>
  .wrapper {
    margin: 0 auto;
    text-align: center;
  }
  .showw {
    display: block;
  }
  .hidee {
    display: none;
  }
  .select {
    width: 100%;
    height: 40px;
    line-height: 40px;
    border: 1px solid #333;
  }
  .bottom {
    height: 140px;
    clear: both;
    text-align: center;
  }
  .btn {
    margin-top: 60px;
    width: 50%;
    height: 40px;
    line-height: 40px;
    border: 1px solid #f3f3f3;
    background-color: #f1f1f1;
  }

  .ipt_clear { width:100%; clear:both; height:80px; }
  .til { width:150px; overflow:hidden; text-align: right; height:60px; line-height:60px; font-size:30px; }
  .ipt {
    margin: 0 auto;
    width: 75%;
    height: 60px;
    line-height: 60px;
    border: 1px solid #cccccc;
    font-size: 26px;
    background-color: #ffffff;
  }
  .ipt1 {
    float: left;
    margin-left: 12%;
    width: 25%;
  }
  .ipt2 {
    float: left;
    width: 50%;
  }
  .select {
    width: 75%;
  }
  .ipt_label {
    margin: 0 auto;
    width: 75%;
  }
  .btn { width:400px; margin:0 auto; height:60px; border:1px solid #cccccc; font-size:26px; background-color:#ccc; }
  .ipt_label1 { margin-left:120px; }
  .ipt_labelx { margin-left: 80px; width: 480px; overflow: hidden; text-align:left; font-size: 16px; }
  .no_radius { border-radius: 0; }
  .fl_title { font-size:40px; text-align:center; height:60px; line-height:60px; }
  .fl_memo { font-size:24px; overflow:scroll; line-height:150%; height:1000px; }
  .fl_close { text-align:center; line-height:80px; font-size: 16px; }
  .fdbtn { position: fixed; padding-top: 30px; bottom: 0px; width: 100%; height: 200px; background-color: #ffffff; z-index:100; text-align: left; }
  .tj { width: 100%; text-align: center; padding-bottom: 20px; }
  .flsm { display:none; width:100%; height:100%; overflow:hidden; position: fixed; top:0; left:0; }
  .flbg { position: absolute; width:100%; height:100%; background:#ffffff; }
  .flbody { position: absolute; padding:40px 40px; height:1200px; }
  .flclose { position: absolute; text-align:right; right:30px; font-size:30px; color: #000000; }
</style>
