export const PROVINCES = ['京', '津', '冀', '晋', '蒙', '辽', '吉', '黑', '沪', '苏', '浙', '皖', '闽', '赣', '鲁', '豫', '鄂', '湘', '粤', '桂', '琼', '渝', '川', '贵', '云', '藏', '陕', '甘', '青', '宁', '新', null, null, null, null]

export const CARTYPES = [
  {code: '51', value: '大型新能源汽车'},
  {code: '52', value: '小型新能源汽车'},
  {code: '01', value: '大型汽车'},
  {code: '02', value: '小型汽车'},
  {code: '03', value: '使馆汽车'},
  {code: '04', value: '领馆汽车'},
  {code: '05', value: '境外汽车'},
  {code: '06', value: '外籍汽车'},
  {code: '07', value: '普通摩托车'},
  {code: '08', value: '轻便摩托车'},
  {code: '09', value: '使馆摩托车'},
  {code: '10', value: '领馆摩托车'},
  {code: '11', value: '境外摩托车'},
  {code: '12', value: '外籍摩托车'},
  {code: '13', value: '低速车'},
  {code: '14', value: '拖拉机'},
  {code: '15', value: '挂车'},
  {code: '16', value: '教练汽车'},
  {code: '17', value: '教练摩托车'},
  {code: '18', value: '试验汽车'},
  {code: '19', value: '试验摩托车'},
  {code: '20', value: '临时入境汽车'},
  {code: '21', value: '临时入境摩托车'},
  {code: '22', value: '临时行驶车'},
  {code: '23', value: '警用汽车'},
  {code: '24', value: '警用摩托车'},
  {code: '25', value: '原农机号牌'},
  {code: '26', value: '香港入出境车'},
  {code: '27', value: '澳门入出境车'}
]

export const ILLEGAL_STATEMENT = [
  {
    title: '1.  查询范围',
    state: false,
    content: '交通违法缴罚：粤牌小型汽车和粤牌小型新能源汽车在各地产生的违法行为。<br> 罚单代缴：各类型车辆在广东省产生的处罚决定书（不是告知单，请完成认罚，领取处罚决定书后再进行查询办理'
  },
  {
    title: '2.  处理时间',
    state: false,
    content: '交通违法缴罚：2-5个工作日（不含下单日）内处理完成，国家法定节假日不属于工作日，会导致办理时限延长，请各位耐心等待。<br> 罚单代缴：下单成功后将在1-4个工作日内处理完毕。'
  },
  {
    title: '3.  办理结果',
    state: false,
    content: '在查询首页直接进入“我的订单”，或关注“小优车务”百度熊掌号。'
  },
  {
    title: '4.  退款情况',
    state: false,
    content: '订单处理结果为失败的，我们会及时进行退款，款项将于7个工作日内原路退回。'
  },
  {
    title: '5.  滞纳金',
    state: false,
    content: '针对电子违法，处理时间延长不会产生滞纳金。<br/>针对已转决定书的违法，认罚后请在15天内缴费，若超期需缴纳每天3％的滞纳金，因涉及办理周期，决定书代缴计算滞纳金自认罚第11日起。（由于客户信息填写错误导致的经济损失将由客户自行承担，办理延误所产生的滞纳金由我方承担。）'
  }
]
